final List<Map<String, dynamic>> geeta_16 = [
  {
    "chapter": 16,
    "shlok": 01,
    "text": """    श्रीभगवानुवाच।
अभयं सत्त्वसंशुद्धिर्ज्ञानयोगव्यवस्थितिः ।
दानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम् ॥1॥
""",
  },
  {
    "chapter": 16,
    "shlok": 02,
    "text": """अहिंसा सत्यमक्रोधास्त्यागः शान्तिरपैशुनम् ।
दया भूतेष्वलोलुप्त्वं मार्दवं ह्रीरचापलम् ॥2॥
""",
  },
  {
    "chapter": 16,
    "shlok": 03,
    "text": """तेजः क्षमा धृतिः शौचमद्रोहोनातिमानिता ।
भवन्ति सम्पदं दैवीमभिजातस्य भारत ॥3॥
""",
  },
  {
    "chapter": 16,
    "shlok": 04,
    "text": """दम्भो दर्पोऽभिमानश्च क्रोध: पारुष्यमेव च ।
अज्ञानं चाभिजातस्य पार्थ सम्पदमासुरीम् ॥4॥
""",
  },
  {
    "chapter": 16,
    "shlok": 05,
    "text": """दैवी सम्पद्विमोक्षाय निबन्धायासुरी मता ।
मा शुचः सम्पदं दैवीमभिजातोऽसि पाण्डव ॥5॥
""",
  },
  {
    "chapter": 16,
    "shlok": 06,
    "text": """द्वौ भूतसर्गौ लोकेऽस्मिन्दैव आसुर एव च ।
दैवो विस्तरश: प्रोक्त आसुरं पार्थ मे शृणु ॥6॥
""",
  },
  {
    "chapter": 16,
    "shlok": 07,
    "text": """प्रवृत्तिं च निवृत्तिं च जना न विदुरासुराः ।
न शौचं नापि चाचारो न सत्यं तेषु विद्यते ॥7॥
""",
  },
  {
    "chapter": 16,
    "shlok": 08,
    "text": """असत्यमप्रतिष्ठं ते जगदाहुरनीश्वरम् ।
अपरस्परसम्भूतं किमन्यत्कामहैतुकम् ॥8॥
""",
  },
  {
    "chapter": 16,
    "shlok": 09,
    "text": """एतां दृष्टिमवष्टभ्य नष्टात्मानोऽल्पबुद्धयः ।
प्रभवन्त्युग्रकर्माणः क्षयाय जगतोऽहिताः ॥9॥
""",
  },
  {
    "chapter": 16,
    "shlok": 10,
    "text": """काममाश्रित्य दुष्पूरं दम्भमानमदान्विता: ।
मोहाद्गृहीत्वासद्ग्राहान्प्रवर्तन्तेऽशुचिव्रता: ॥10॥
""",
  },
  {
    "chapter": 16,
    "shlok": 11,
    "text": """चिन्तामपरिमेयां च प्रलयान्तामुपाश्रिताः ।
कामोपभोगपरमा एतावदिति निश्चिताः ॥11॥
""",
  },
  {
    "chapter": 16,
    "shlok": 12,
    "text": """आशापाशशतैर्बद्धा: कामक्रोधपरायणा: ।
ईहन्ते कामभोगार्थमन्यायेनार्थसञ्जयान् ॥12॥
""",
  },
  {
    "chapter": 16,
    "shlok": 13,
    "text": """इदमद्य मया लब्धमिमं प्राप्स्ये मनोरथम्
इदमस्तीदमपि मे भविष्यति पुनर्धनम्॥13॥
""",
  },
  {
    "chapter": 16,
    "shlok": 14,
    "text": """असौ मया हतः शत्रुर्हनिष्ये चापरानपि ।
ईश्वरोऽहमहं भोगी सिद्धोऽहं बलवान्सुखी ॥14॥
""",
  },
  {
    "chapter": 16,
    "shlok": 15,
    "text": """आढ्योऽभिजनवानस्मि कोऽन्योऽस्ति सदृशो मया ।
यक्ष्ये दास्यामि मोदिष्य इत्यज्ञानविमोहिताः ॥15॥
""",
  },
  {
    "chapter": 16,
    "shlok": 16,
    "text": """अनेकचित्तविभ्रान्ता मोहजालसमावृता: ।
प्रसक्ता: कामभोगेषु पतन्ति नरकेऽशुचौ ॥16॥
""",
  },
  {
    "chapter": 16,
    "shlok": 17,
    "text": """आत्मसम्भाविताः स्तब्धा धानमानमदान्विताः ।
यजन्ते नामयज्ञैस्ते दम्भेनाविधिपूर्वकम् ॥17॥
""",
  },
  {
    "chapter": 16,
    "shlok": 18,
    "text": """अहङ्कारं बलं दर्पं कामं क्रोधं च संश्रिता: ।
मामात्मपरदेहेषु प्रद्विषन्तोऽभ्यसूयका: ॥18॥
""",
  },
  {
    "chapter": 16,
    "shlok": 19,
    "text": """तानहं द्विषतः क्रूरान्संसारेषु नराधामान् ।
क्षिपाम्यजस्त्रमशुभानासुरीष्वेव योनिषु ॥19॥
""",
  },
  {
    "chapter": 16,
    "shlok": 20,
    "text": """आसुरीं योनिमापन्ना मूढ़ा जन्मनि जन्मनि।
मामप्राप्यैव कौन्तेय ततो यान्त्यधमां गतिम् ॥20॥
""",
  },
  {
    "chapter": 16,
    "shlok": 21,
    "text": """त्रिविधं नरकस्येदं द्वारं नाशनमात्मन: ।
काम: क्रोधस्तथा लोभस्तस्मादेतत्त्रयं त्यजेत् ॥21॥
""",
  },
  {
    "chapter": 16,
    "shlok": 22,
    "text": """एतैर्विमुक्तः कौन्तेय तमोद्वारैस्त्रिभिर्नरः ।
आचरत्यात्मनः श्रेयस्ततो याति परां गतिम् ॥22॥
""",
  },
  {
    "chapter": 16,
    "shlok": 23,
    "text": """य: शास्त्रविधिमुत्सृज्य वर्तते कामकारत: ।
न स सिद्धिमवाप्नोति न सुखं न परां गतिम् ॥23॥
""",
  },
  {
    "chapter": 16,
    "shlok": 24,
    "text": """तस्माच्छास्त्रं प्रमाणं ते कार्याकार्यव्यवस्थितौ ।
ज्ञात्वा शास्त्रविधानोक्तं कर्म कर्तुमिहार्हसि ॥24॥
""",
  },
];
