final List<Map<String, dynamic>> geeta_13 = [
  {
    "chapter": 13,
    "shlok": 01,
    "text": """अर्जुन उवाच ।
प्रकृतिं पुरुषं चैव क्षेत्रं क्षेत्रज्ञमेव च ।
एतद्वेदितुमिच्छामि ज्ञानं ज्ञेयं च केशव ॥1॥
""",
  },
  {
    "chapter": 13,
    "shlok": 02,
    "text": """श्रीभगवानुवाच ।
इदं शरीरं कौन्तेय क्षेत्रमित्यभिधीयते ।
एतद्यो वेत्ति तं प्राहु: क्षेत्रज्ञ इति तद्विद: ॥2॥
""",
  },
  {
    "chapter": 13,
    "shlok": 03,
    "text": """क्षेत्रज्ञं चापि मां विद्धि सर्वक्षेत्रेषु भारत ।
क्षेत्रक्षेत्रज्ञयोर्ज्ञानं यत्तज्ज्ञानं मतं मम ॥3॥
""",
  },
  {
    "chapter": 13,
    "shlok": 04,
    "text": """तत्क्षेत्रं यच्च यादृक्च यद्विकारि यतश्च यत् ।
स च यो यत्प्रभावश्च तत्समासेन मे शृणु ॥4॥
""",
  },
  {
    "chapter": 13,
    "shlok": 05,
    "text": """ऋषिभिर्बहुधा गीतं छन्दोभिर्विविधै: पृथक् ।
ब्रह्मसूत्रपदैश्चैव हेतुमद्भिर्विनिश्चितै: ॥5 ॥
""",
  },
  {
    "chapter": 13,
    "shlok": 06,
    "text": """महाभूतान्यहङ्ककारो बुद्धिरव्यक्त मेव च ।
इन्द्रियाणि दशैकं च पञ्च चेन्द्रियगोचराः ॥6॥
""",
  },
  {
    "chapter": 13,
    "shlok": 07,
    "text": """इच्छा द्वेष: सुखं दु:खं सङ्घातश्चेतना धृति: ।
एतत्क्षेत्रं समासेन सविकारमुदाहृतम् ॥7॥
""",
  },
  {
    "chapter": 13,
    "shlok": 08,
    "text": """अमानित्वमदम्भित्वमहिंसा क्षान्तिरार्जवम् ।
आचार्योपासनं शौचं स्थैर्यमात्मविनिग्रहः ॥8॥
""",
  },
  {
    "chapter": 13,
    "shlok": 09,
    "text": """इन्द्रियार्थेषु वैराग्यमनहङ्कार एव च ।
जन्ममृत्युजराव्याधिदुःखदोषानुदर्शनम् ॥9॥
""",
  },
  {
    "chapter": 13,
    "shlok": 10,
    "text": """असक्तिरनभिष्वङ्गः पुत्रदारगृहादिषु ।
नित्यं च समचित्तत्वमिष्टानिष्टोपपत्तिषु ॥10॥
""",
  },
  {
    "chapter": 13,
    "shlok": 11,
    "text": """मयि चानन्ययोगेन भक्तिरव्यभिचारिणी ।
विविक्तदेशसेवित्वमरतिर्जनसंसदि ॥11॥
""",
  },
  {
    "chapter": 13,
    "shlok": 12,
    "text": """अध्यात्मज्ञाननित्यत्वं तत्त्वज्ञानार्थदर्शनम् ।
एतज्ज्ञानमिति प्रोक्तमज्ञानं यदतोऽन्यथा ॥12॥
""",
  },
  {
    "chapter": 13,
    "shlok": 13,
    "text": """ज्ञेयं यत्तत्प्रवक्ष्यामि यज्ज्ञात्वामृतमश्रुते ।
अनादिमत्परं ब्रह्म न सत्तन्नासदुच्यते ॥13॥
""",
  },
  {
    "chapter": 13,
    "shlok": 14,
    "text": """सर्वतःपाणिपादं तत्सर्वतोऽक्षिशिरोमुखम् ।
सर्वतःश्रुतिमल्लोके सर्वमावृत्य तिष्ठति ॥14॥
""",
  },
  {
    "chapter": 13,
    "shlok": 15,
    "text": """सर्वेन्द्रियगुणाभासं सर्वेन्द्रियविवर्जितम् ।
असक्तं सर्वभृच्चैव निर्गुणं गुणभोक्तृ च ॥15॥
""",
  },
  {
    "chapter": 13,
    "shlok": 16,
    "text": """बहिरन्तश्च भूतानामचरं चरमेव च।
सूक्ष्मत्वात्तदविज्ञेयं दूरस्थं चान्तिके च तत् ॥16॥
""",
  },
  {
    "chapter": 13,
    "shlok": 17,
    "text": """अविभक्तं च भूतेषु विभक्तमिव च स्थितम् ।
भूतभर्तृ च तज्ज्ञेयं ग्रसिष्णु प्रभविष्णु च ॥17॥
""",
  },
  {
    "chapter": 13,
    "shlok": 18,
    "text": """ज्योतिषामपि तज्ज्योतिस्तमसः परमुच्यते ।
ज्ञानं ज्ञेयं ज्ञानगम्यं हृदि सर्वस्य विष्ठितम् ॥18॥
""",
  },
  {
    "chapter": 13,
    "shlok": 19,
    "text": """इति क्षेत्रं तथा ज्ञानं ज्ञेयं चोक्तं समासत: ।
मद्भक्त एतद्विज्ञाय मद्भावायोपपद्यते ॥19॥
""",
  },
  {
    "chapter": 13,
    "shlok": 20,
    "text": """प्रकृतिं पुरुषं चैव विद्ध्यनादी उभावपि ।
विकारांश्च गुणांश्चैव विद्धि प्रकृतिसम्भवान् ॥20॥
""",
  },
  {
    "chapter": 13,
    "shlok": 21,
    "text": """कार्यकारणकर्तृत्वे हेतु: प्रकृतिरुच्यते ।
पुरुष: सुखदु:खानां भोक्तृत्वे हेतुरुच्यते ॥21॥
""",
  },
  {
    "chapter": 13,
    "shlok": 22,
    "text": """पुरुषः प्रकृतिस्थो हि भुङ्क्ते प्रकृतिजान्गुणान्।
कारणं गुणसङ्गोऽस्य सदसद्योनिजन्मसु ॥22॥
""",
  },
  {
    "chapter": 13,
    "shlok": 23,
    "text": """उपद्रष्टानुमन्ता च भर्ता भोक्ता महेश्वर: ।
परमात्मेति चाप्युक्तो देहेऽस्मिन्पुरुष: पर: ॥23॥
""",
  },
  {
    "chapter": 13,
    "shlok": 24,
    "text": """य एवं वेत्ति पुरुष प्रकृतिं च गुणैः सह ।
सर्वथा वर्तमानोऽपि न स भूयोऽभिजायते ॥24॥
""",
  },
  {
    "chapter": 13,
    "shlok": 25,
    "text": """ध्यानेनात्मनि पश्यन्ति केचिदात्मानमात्मना ।
अन्ये साङ् ख्येन योगेन कर्मयोगेन चापरे ॥25॥
""",
  },
  {
    "chapter": 13,
    "shlok": 26,
    "text": """अन्ये त्वेवमजानन्तः श्रुत्वान्येभ्य उपासते ।
तेऽपि चातितरन्त्येव मृत्युं श्रुतिपरायणाः ॥26॥
""",
  },
  {
    "chapter": 13,
    "shlok": 27,
    "text": """यावत्सञ्जायते किञ्चित्सत्वं स्थावरजङ्गमम् ।
क्षेत्रक्षेत्रज्ञसंयोगात्तद्विद्धि भरतर्षभ ॥27॥
""",
  },
  {
    "chapter": 13,
    "shlok": 28,
    "text": """समं सर्वेषु भूतेषु तिष्ठन्तं परमेश्वरम् ।
विनश्यत्स्वविनश्यन्तं यः पश्यति स पश्यति ॥28॥
""",
  },
  {
    "chapter": 13,
    "shlok": 29,
    "text": """समं पश्यन्हि सर्वत्र समवस्थितमीश्वरम् ।
न हिनस्त्यात्मनात्मानं ततो याति परां गतिम् ॥29॥
""",
  },
  {
    "chapter": 13,
    "shlok": 30,
    "text": """    प्रकृत्यैव च कर्माणि क्रियमाणानि सर्वशः ।
यः पश्यति तथात्मानकर्तारं स पश्यति ॥30॥
""",
  },
  {
    "chapter": 13,
    "shlok": 31,
    "text": """यदा भूतपृथग्भावमेकस्थमनुपश्यति ।
तत एव च विस्तारं ब्रह्म सम्पद्यते तदा ॥31॥
""",
  },
  {
    "chapter": 13,
    "shlok": 32,
    "text": """अनादित्वान्निर्गुणत्वात्परमात्मायमव्ययः ।
शरीरस्थोऽपि कौन्तेय न करोति न लिप्यते ॥32॥
""",
  },
  {
    "chapter": 13,
    "shlok": 33,
    "text": """यथा सर्वगतं सौक्ष्म्यादाकाशं नोपलिप्यते ।
सर्वत्रावस्थितो देहे तथात्मा नोपलिप्यते ॥33॥
""",
  },
  {
    "chapter": 13,
    "shlok": 34,
    "text": """यथा प्रकाशयत्येकः कृत्स्नं लोकमिमं रविः।
क्षेत्रं क्षेत्री तथा कृत्स्नं प्रकाशयति भारत ॥34॥
""",
  },
  {
    "chapter": 13,
    "shlok": 35,
    "text": """क्षेत्रक्षेत्रज्ञयोरेवमन्तरं ज्ञानचक्षुषा।
भूतप्रकृतिमोक्षं च ये विदुर्यान्ति ते परम् ॥35॥
""",
  },
];
