final List<Map<String, dynamic>> geeta_06 = [
  {
    "chapter": 06,
    "shlok": 01,
    "text": """श्रीभगवानुवाच ।
अनाश्रित: कर्मफलं कार्यं कर्म करोति य: ।
स संन्यासी च योगी च न निरग्निर्न चाक्रिय: ॥1॥
""",
  },
  {
    "chapter": 06,
    "shlok": 02,
    "text": """यं संन्यासमिति प्राहुर्योगं तं विद्धि पाण्डव ।
न ह्यसंन्यस्तसङ्कल्पो योगी भवति कश्चन ॥2॥
""",
  },
  {
    "chapter": 06,
    "shlok": 03,
    "text": """आरुरुक्षोर्मुनेर्योगं कर्म कारणमुच्यते ।
योगारूढस्य तस्यैव शम: कारणमुच्यते ॥3॥
""",
  },
  {
    "chapter": 06,
    "shlok": 04,
    "text": """यदा हि नेन्द्रियार्थेषु न कर्मस्वनुषज्जते ।
सर्वसङ्कल्पसंन्यासी योगारूढस्तदोच्यते ॥4॥
""",
  },
  {
    "chapter": 06,
    "shlok": 05,
    "text": """उद्धरेदात्मनात्मानं नात्मानमवसादयेत् ।
आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मन: ॥5॥
""",
  },
  {
    "chapter": 06,
    "shlok": 06,
    "text": """बन्धुरात्मात्मनस्तस्य येनात्मैवात्मना जितः ।
अनात्मनस्तु शत्रुत्वे वर्ते तात्मैव शत्रुवत् ॥6॥
""",
  },
  {
    "chapter": 06,
    "shlok": 07,
    "text": """जितात्मन: प्रशान्तस्य परमात्मा समाहित: ।
शीतोष्णसुखदु:खेषु तथा मानापमानयो: ॥7॥
""",
  },
  {
    "chapter": 06,
    "shlok": 08,
    "text": """ज्ञानविज्ञानतृप्तात्मा कूटस्थो विजितेन्द्रियः।
युक्त इत्युच्यते योगी समलोष्टाश्मकाञ्चनः ॥8॥
""",
  },
  {
    "chapter": 06,
    "shlok": 09,
    "text": """सुहृन्मित्रार्युदासीनमध्यस्थद्वेष्यबन्धुषु ।
साधुष्वपि च पापेषु समबुद्धिर्विशिष्यते ॥9॥
""",
  },
  {
    "chapter": 06,
    "shlok": 10,
    "text": """योगी युञ्जीत सततमात्मानं रहसि स्थितः।
एकाकी यतचित्तात्मा निराशीरपरिग्रहः ॥10॥
""",
  },
  {
    "chapter": 06,
    "shlok": 11,
    "text": """शुचौ देशे प्रतिष्ठाप्य स्थिरमासनमात्मन: ।
नात्युच्छ्रितं नातिनीचं चैलाजिनकुशोत्तरम् ॥11॥
""",
  },
  {
    "chapter": 06,
    "shlok": 12,
    "text": """तत्रैकाग्रं मनः कृत्वा यतचित्तेन्द्रियक्रियः ।
उपविश्यासने युञ्जयाद्योगमात्मविशुद्धये ॥12॥
""",
  },
  {
    "chapter": 06,
    "shlok": 13,
    "text": """समं कायशिरोग्रीवं धारयन्नचलं स्थिरः ।
सम्प्रेक्ष्य नासिकाग्रं स्वं दिशश्चानवलोकयन् ॥13॥
""",
  },
  {
    "chapter": 06,
    "shlok": 14,
    "text": """प्रशान्तात्मा विगतभीर्ब्रह्मचारिव्रते स्थित: ।
मन: संयम्य मच्चित्तो युक्त आसीत मत्पर: ॥14॥
""",
  },
  {
    "chapter": 06,
    "shlok": 15,
    "text": """युञ्जन्नेवं सदात्मानं योगी नियतमानसः ।
शान्तिं निर्वाणपरमां मत्संस्थामधिगच्छति ॥15॥
""",
  },
  {
    "chapter": 06,
    "shlok": 16,
    "text": """नात्यश्नतस्तु योगोऽस्ति न चैकान्तमनश्नत: ।
न चाति स्वप्नशीलस्य जाग्रतो नैव चार्जुन ॥16॥
""",
  },
  {
    "chapter": 06,
    "shlok": 17,
    "text": """युक्ताहारविहारस्य युक्तचेष्टस्य कर्मसु ।
युक्तस्वप्नावबोधस्य योगो भवति दुःखहा ॥17॥
""",
  },
  {
    "chapter": 06,
    "shlok": 18,
    "text": """यदा विनियतं चित्तमात्मन्येवावतिष्ठते ।
नि:स्पृह: सर्वकामेभ्यो युक्त इत्युच्यते तदा ॥18॥
""",
  },
  {
    "chapter": 06,
    "shlok": 19,
    "text": """यथा दीपो निवातस्थो नेते सोपमा स्मृता।
योगिनो यतचित्तस्य युञ्जतो योगमात्मनः ॥19॥
""",
  },
  {
    "chapter": 06,
    "shlok": 20,
    "text": """यत्रोपरमते चित्तं निरुद्धं योगसेवया ।
यत्र चैवात्मनात्मानं पश्यन्नात्मनि तुष्यति ॥20॥
""",
  },
  {
    "chapter": 06,
    "shlok": 21,
    "text": """सुखमात्यन्तिकं यत्तबुद्धिग्राह्ममतीन्द्रियम् ।
वेत्ति यत्र न चैवायं स्थितश्चलति तत्त्वतः ॥21॥
""",
  },
  {
    "chapter": 06,
    "shlok": 22,
    "text": """यं लब्ध्वा चापरं लाभं मन्यते नाधिकं तत: ।
यस्मिन्स्थितो न दु:खेन गुरुणापि विचाल्यते ॥22॥
""",
  },
  {
    "chapter": 06,
    "shlok": 23,
    "text": """तं विद्यादः दुःखसंयोगवियोगं योगसज्ञितम् ।
स निश्चयेन योक्तव्यो योगोऽनिर्विण्णचेतसा ॥23॥
""",
  },
  {
    "chapter": 06,
    "shlok": 24,
    "text": """सङ्कल्पप्रभवान्कामांस्त्यक्त्वा सर्वानशेषत: ।
मनसैवेन्द्रियग्रामं विनियम्य समन्तत: ॥24॥
""",
  },
   {
    "chapter": 06,
    "shlok": 25,
    "text": """शनै: शनैरुपरमेद्बुद्ध्या धृतिगृहीतया ।
आत्मसंस्थं मन: कृत्वा न किञ्चिदपि चिन्तयेत् ॥25॥
""",
  },
  {
    "chapter": 06,
    "shlok": 26,
    "text": """यतो यतो निश्चरति मनश्चञ्चलमस्थिरम् ।
ततस्ततो नियम्यैतदात्मन्येव वशं नयेत् ॥26॥
""",
  },
  {
    "chapter": 06,
    "shlok": 27,
    "text": """प्रशान्तमनसं ह्येनं योगिनं सुखमुत्तमम् ।
उपैति शान्तरजसं ब्रह्मभूतमकल्मषम् ॥27॥
""",
  },
  {
    "chapter": 06,
    "shlok": 28,
    "text": """युञ्जन्नेवं सदात्मानं योगी विगतकल्मषः ।
सुखेन ब्रह्मसंस्पर्शमत्यन्तं सुखमश्नुते ॥28॥
""",
  },
  {
    "chapter": 06,
    "shlok": 29,
    "text": """सर्वभूतस्थमात्मानं सर्वभूतानि चात्मनि ।
ईक्षते योगयुक्तात्मा सर्वत्र समदर्शन: ॥29॥
""",
  },
  {
    "chapter": 06,
    "shlok": 30,
    "text": """यो मां पश्यति सर्वत्र सर्वं च मयि पश्यति ।
तस्याहं न प्रणश्यामि स च मे न प्रणश्यति ॥30॥
""",
  },
  {
    "chapter": 06,
    "shlok": 31,
    "text": """सर्वभूतस्थितं यो मां भजत्येकत्वमास्थित: ।
सर्वथा वर्तमानोऽपि स योगी मयि वर्तते ॥31॥
""",
  },
  {
    "chapter": 06,
    "shlok": 32,
    "text": """आत्मौपम्येन सर्वत्र समं पश्यति योऽर्जुन ।
सुखं वा यदि वा दु:खं स योगी परमो मत: ॥32॥
""",
  },
  {
    "chapter": 06,
    "shlok": 33,
    "text": """अर्जन उवाच।
योऽयं योगस्त्वया प्रोक्तः साम्येन मधुसूदन।
एतस्याहं न पश्यामि चञ्चलत्वात्स्थितिं स्थिराम् ॥33॥
""",
  },
  {
    "chapter": 06,
    "shlok": 34,
    "text": """चञ्चलं हि मन: कृष्ण प्रमाथि बलवद्दृढम् ।
तस्याहं निग्रहं मन्ये वायोरिव सुदुष्करम् ॥34॥
""",
  },
  {
    "chapter": 06,
    "shlok": 35,
    "text": """श्रीभगवानुवाच।
असंशयं महाबाहो मनो दुर्निग्रहं चलम् ।
अभ्यासेन तु कौन्तेय वैराग्येण च गृह्यते ॥35॥
""",
  },
  {
    "chapter": 06,
    "shlok": 36,
    "text": """असंयतात्मना योगो दुष्प्राप इति मे मति: ।
वश्यात्मना तु यतता शक्योऽवाप्तुमुपायत: ॥36॥
""",
  },
  {
    "chapter": 06,
    "shlok": 37,
    "text": """अर्जुन उवाच।
अयतिः श्रद्धयोपेतो योगाच्चलितमानसः ।
अप्राप्य योगसंसिद्धिं कां गतिं कृष्ण गच्छति ॥37॥
""",
  },
  {
    "chapter": 06,
    "shlok": 38,
    "text": """कच्चिन्नोभयविभ्रष्टश्छिन्नाभ्रमिव नश्यति ।
अप्रतिष्ठो महाबाहो विमूढो ब्रह्मण: पथि ॥38॥
""",
  },
  {
    "chapter": 06,
    "shlok": 39,
    "text": """एतन्मे संशयं कृष्ण छेत्तुमर्हस्यशेषतः ।
त्वदन्यः संशयस्यास्य छेत्ता न ह्युपपद्यते ॥39॥
""",
  },
  {
    "chapter": 06,
    "shlok": 40,
    "text": """श्रीभगवानुवाच ।
पार्थ नैवेह नामुत्र विनाशस्तस्य विद्यते ।
न हि कल्याणकृत्कश्चिद्दुर्गतिं तात गच्छति ॥40॥
""",
  },
  {
    "chapter": 06,
    "shlok": 41,
    "text": """प्राप्य पुण्यकृतां लोकानुषित्वा शाश्वतीः समाः ।
शुचीनां श्रीमतां गेहे योगभ्रष्टोऽभिजायते ॥41॥
""",
  },
  {
    "chapter": 06,
    "shlok": 42,
    "text": """अथवा योगिनामेव कुले भवति धीमताम् ।
एतद्धि दुर्लभतरं लोके जन्म यदीदृशम् ॥42॥
""",
  },
  {
    "chapter": 06,
    "shlok": 43,
    "text": """तत्र तं बुद्धिसंयोगं लभते पौर्वदेहिकम् ।
यतते च ततो भूय: संसिद्धौ कुरुनन्दन ॥43॥
""",
  },
  {
    "chapter": 06,
    "shlok": 44,
    "text": """पूर्वाभ्यासेन तेनैव ह्रियते ह्यवशोऽपि सः ।
जिज्ञासुरपि योगस्य शब्दब्रह्मातिवर्तते ॥44॥
""",
  },
  {
    "chapter": 06,
    "shlok": 45,
    "text": """प्रयत्नाद्यतमानस्तु योगी संशुद्धकिल्बिष: ।
अनेकजन्मसंसिद्धस्ततो याति परां गतिम् ॥45॥
""",
  },
  {
    "chapter": 06,
    "shlok": 46,
    "text": """तपस्विभ्योऽधिको योगी ज्ञानिभ्योऽपि मतोऽधिकः ।
कर्मिभ्यश्चाधिको योगी तस्माद्योगी भवार्जुन ॥46॥
""",
  },
  {
    "chapter": 06,
    "shlok": 47,
    "text": """योगिनामपि सर्वेषां मद्गतेनान्तरात्मना ।
श्रद्धावान्भजते यो मां स मे युक्ततमो मत: ॥47॥
""",
  },
];
