final List<Map<String, dynamic>> geeta_17 = [
  {
    "chapter": 17,
    "shlok": 01,
    "text": """अर्जुन उवाच ।
ये शास्त्रविधिमुत्सृज्य यजन्ते श्रद्धयान्विता: ।
तेषां निष्ठा तु का कृष्ण सत्त्वमाहो रजस्तम: ॥1॥
""",
  },
  {
    "chapter": 17,
    "shlok": 02,
    "text": """श्रीभगवानुवाच।
त्रिविद्या भवति श्रद्धा देहिनां सा स्वभावजा ।
सात्त्विकी राजसी चैव तामसी चेति तां शृणु ॥2॥
""",
  },
  {
    "chapter": 17,
    "shlok": 03,
    "text": """सत्त्वानुरूपा सर्वस्य श्रद्धा भवति भारत ।
श्रद्धामयोऽयं पुरुषो यो यच्छ्रद्ध: स एव स: ॥3॥
""",
  },
  {
    "chapter": 17,
    "shlok": 04,
    "text": """यजन्ते सात्त्विका देवान्यक्षरक्षांसि राजसा: ।
प्रेतान्भूतगणांश्चान्ये यजन्ते तामसा जना: ॥4॥
""",
  },
  {
    "chapter": 17,
    "shlok": 05,
    "text": """अशास्त्रविहितं घोरं तप्यन्ते ये तपो जनाः।
दम्भाहङ्कारसंयुक्ताः कामरागबलान्विताः ॥5॥
""",
  },
   {
    "chapter": 17,
    "shlok": 06,
    "text": """कर्षयन्तः शरीरस्थं भूतग्राममचेतसः।
मां चैवान्तःशरीरस्थं तान्विद्ध्यासुरनिश्चयान् ॥6॥
""",
  },
  {
    "chapter": 17,
    "shlok": 07,
    "text": """आहारस्त्वपि सर्वस्य त्रिविधो भवति प्रिय: ।
यज्ञस्तपस्तथा दानं तेषां भेदमिमं शृणु ॥7॥
""",
  },
  {
    "chapter": 17,
    "shlok": 08,
    "text": """आयुः सत्त्वबलारोग्यसुखप्रीतिविवर्धानाः।
रस्याः स्निग्धाः स्थिरा हृद्या आहाराः सात्त्विकप्रियाः ॥8॥
""",
  },
  {
    "chapter": 17,
    "shlok": 09,
    "text": """कट्वम्ललवणात्युष्णतीक्ष्णरूक्षविदाहिन: ।
आहारा राजसस्येष्टा दु:खशोकामयप्रदा: ॥9॥
""",
  },
  {
    "chapter": 17,
    "shlok": 10,
    "text": """यातयामं गतरसं पूति पर्युषितं च यत्।
उच्छिष्टमपि चामेधयं भोजनं तामसप्रियम् ॥10॥
""",
  },
  {
    "chapter": 17,
    "shlok": 11,
    "text": """अफलाकाङ्क्षिभिर्यज्ञो विधिदृष्टो य इज्यते ।
यष्टव्यमेवेति मन: समाधाय स सात्त्विक: ॥11॥
""",
  },
  {
    "chapter": 17,
    "shlok": 12,
    "text": """अभिसन्धाय तु फलं दम्भार्थमपि चैव यत् ।
इज्यते भरतश्रेष्ठ तं यज्ञं विद्धि राजसम् ॥12॥
""",
  },
  {
    "chapter": 17,
    "shlok": 13,
    "text": """विधिहीनमसृष्टान्नं मन्त्रहीनमदक्षिणम् ।
श्रद्धाविरहितं यज्ञं तामसं परिचक्षते ॥13॥
""",
  },
  {
    "chapter": 17,
    "shlok": 14,
    "text": """देवद्विजगुरुप्राज्ञपूजनं शौचमार्जवम् ।
ब्रह्मचर्यमहिंसा च शारीरं तप उच्यते ॥14॥
""",
  },
  {
    "chapter": 17,
    "shlok": 15,
    "text": """अनुद्वेगकरं वाक्यं सत्यं प्रियहितं च यत् ।
स्वाध्यायाभ्यसनं चैव वाङ्मयं तप उच्यते ॥15॥
""",
  },
  {
    "chapter": 17,
    "shlok": 16,
    "text": """मनःप्रसादः सौम्यत्वं मौनमात्मविनिग्रहः ।
भावसंशुद्धिरित्येतत्तपो मानसमुच्यते ॥16॥
""",
  },
  {
    "chapter": 17,
    "shlok": 17,
    "text": """श्रद्धया परया तप्तं तपस्तत्त्रिविधं नरै: ।
अफलाकाङ्क्षिभिर्युक्तै: सात्त्विकं परिचक्षते ॥17॥
""",
  },
  {
    "chapter": 17,
    "shlok": 18,
    "text": """सत्कारमानपूजार्थं तपो दम्भेन चैव यत्।
क्रियते तहिद प्रोक्तं राजसं चलमध्रुवम् ॥18॥
""",
  },
  {
    "chapter": 17,
    "shlok": 19,
    "text": """मूढग्राहेणात्मनो यत्पीडया क्रियते तप: ।
परस्योत्सादनार्थं वा तत्तामसमुदाहृतम् ॥19॥
""",
  },
  {
    "chapter": 17,
    "shlok": 20,
    "text": """दातव्यमिति यदानं दीयतेऽनुपकारिणेत्र ।
देशे काले च पात्रे च तद्दानं सात्त्विकं स्मृतम् ॥20॥
""",
  },
  {
    "chapter": 17,
    "shlok": 21,
    "text": """यत्तु प्रत्युपकारार्थं फलमुद्दिश्य वा पुन: ।
दीयते च परिक्लिष्टं तद्दानं राजसं स्मृतम् ॥21॥
""",
  },
  {
    "chapter": 17,
    "shlok": 22,
    "text": """अदेशकाले यदानमपात्रेभ्यश्यच दीयते ।
असत्कृतमवज्ञातं तत्तामसमुदाहृतम् ॥22॥
""",
  },
  {
    "chapter": 17,
    "shlok": 23,
    "text": """ॐ तत्सदिति निर्देशो ब्रह्मणस्त्रिविध: स्मृत: ।
ब्राह्मणास्तेन वेदाश्च यज्ञाश्च विहिता: पुरा ॥23॥
""",
  },
  {
    "chapter": 17,
    "shlok": 24,
    "text": """तस्माद् ॐ इत्युदाहृत्य यज्ञदानतपःक्रियाः।
प्रवर्तन्ते विधानोक्ताः सत्ततं ब्रह्मवादिनाम् ॥24॥
""",
  },
  {
    "chapter": 17,
    "shlok": 25,
    "text": """तदित्यनभिसन्धाय फलं यज्ञतप:क्रिया: ।
दानक्रियाश्च विविधा: क्रियन्ते मोक्षकाङ्क्षिभि: ॥25॥
""",
  },
  {
    "chapter": 17,
    "shlok": 26,
    "text": """सद्भावे साधुभावे च सहित्येतत्प्रयुज्जते ।
प्रशस्ते कर्मणि तथा सच्छब्दः पार्थ युज्यते ॥26॥
""",
  },
  {
    "chapter": 17,
    "shlok": 27,
    "text": """यज्ञे तपसि दाने च स्थितिः सदिति चोच्यते ।
कर्म चैव तदर्थीयं सदित्येवाभिधीयते ॥27॥
""",
  },
  {
    "chapter": 17,
    "shlok": 28,
    "text": """अश्रद्धया हुतं दत्तं तपस्तप्तं कृतं च यत् ।
असदित्युच्यते पार्थ न च तत्प्रेत्य नो इह ॥28॥
""",
  },
];
