final List<Map<String, dynamic>> geeta_14 = [
  {
    "chapter": 14,
    "shlok": 01,
    "text": """श्रीभगवानुवाच ।
परं भूय: प्रवक्ष्यामि ज्ञानानां ज्ञानमुत्तमम् ।
यज्ज्ञात्वा मुनय: सर्वे परां सिद्धिमितो गता: ॥1॥
""",
  },
  {
    "chapter": 14,
    "shlok": 02,
    "text": """इदं ज्ञानमुपाश्रित्य मम साधर्म्यमागताः।
सर्गेऽपि नोपजायन्ते प्रलये न व्यथन्ति च॥2॥
""",
  },
  {
    "chapter": 14,
    "shlok": 03,
    "text": """    मम योनिर्महद् ब्रह्म तस्मिन्गर्भं दधाम्यहम् ।
सम्भव: सर्वभूतानां ततो भवति भारत ॥3॥
""",
  },
  {
    "chapter": 14,
    "shlok": 04,
    "text": """सर्वयोनिषु कौन्तेय मूर्तय: सम्भवन्ति या: ।
तासां ब्रह्म महद्योनिरहं बीजप्रद: पिता ॥4॥
""",
  },
  {
    "chapter": 14,
    "shlok": 05,
    "text": """सत्त्वं रजस्तम इति गुणाः प्रकृतिसम्भवाः।
निबध्नन्ति महाबाहो देहे देहिनमव्ययम् ॥ 5॥
""",
  },
  {
    "chapter": 14,
    "shlok": 06,
    "text": """तत्र सत्त्वं निर्मलत्वात्प्रकाशकमनामयम् ।
सुखसङ्गेन बध्नाति ज्ञानसङ्गेन चानघ ॥6॥
""",
  },
  {
    "chapter": 14,
    "shlok": 07,
    "text": """रजो रागात्मकं विद्धि तृष्णासङ्गसमुद्भवम्।
तन्निबध्नाति कौन्तेय कर्मसङ्गेन देहिनम् ॥7॥
""",
  },
  {
    "chapter": 14,
    "shlok": 08,
    "text": """तमस्त्वज्ञानजं विद्धि मोहनं सर्वदेहिनाम् ।
प्रमादालस्यनिद्राभिस्तन्निबध्नाति भारत ॥8॥
""",
  },
  {
    "chapter": 14,
    "shlok": 09,
    "text": """सत्त्वं सुखे सञ्जयति रजः कर्मणि भारत ।
ज्ञानमावृत्य तु तमः प्रमादे सञ्जयत्युत ॥9॥
""",
  },
  {
    "chapter": 14,
    "shlok": 10,
    "text": """रजस्तमश्चाभिभूय सत्त्वं भवति भारत ।
रज: सत्त्वं तमश्चैव तम: सत्त्वं रजस्तथा ॥10॥
""",
  },
  {
    "chapter": 14,
    "shlok": 11,
    "text": """सर्वद्वारेषु देहेऽस्मिन्प्रकाश उपजायते ।
ज्ञानं यदा तदा विद्याद्विवृद्धं सत्त्वमित्युत ॥11॥
""",
  },
  {
    "chapter": 14,
    "shlok": 12,
    "text": """लोभः प्रवृत्तिरारम्भः कर्मणामशमः स्पृहा ।
रजस्येतानि जायन्ते विवृद्धे भरतर्षभ ॥12॥
""",
  },
  {
    "chapter": 14,
    "shlok": 13,
    "text": """अप्रकाशोऽप्रवृत्तिश्च प्रमादो मोह एव च ।
तमस्येतानि जायन्ते विवृद्धे कुरुनन्दन ॥13॥
""",
  },
  {
    "chapter": 14,
    "shlok": 14,
    "text": """यदा सत्त्वे प्रवृद्धे तु प्रलयं याति देहभृत् ।
तदोत्तमविदां लोकानमलान्प्रतिपद्यते ॥14॥
""",
  },
  {
    "chapter": 14,
    "shlok": 15,
    "text": """रजसि प्रलयं गत्वा कर्मसङ्गिषु जायते ।
तथा प्रलीनस्तमसि मूढयोनिषु जायते ॥15॥
""",
  },
  {
    "chapter": 14,
    "shlok": 16,
    "text": """कर्मणः सुकृतस्याहुः सात्त्विकं निर्मलं फलम् ।
रजसस्तु फलं दुःखमज्ञानं तमसः फलम् ॥16॥
""",
  },
  {
    "chapter": 14,
    "shlok": 17,
    "text": """सत्त्वात्सञ्जायते ज्ञानं रजसो लोभ एव च ।
प्रमादमोहौ तमसो भवतोऽज्ञानमेव च ॥17॥
""",
  },
  {
    "chapter": 14,
    "shlok": 18,
    "text": """ऊर्ध्वं गच्छन्ति सत्त्वस्था मध्ये तिष्ठन्ति राजसाः ।
जघन्यगुणवृत्तिस्था अधो गच्छन्ति तामसाः ॥18॥
""",
  },
  {
    "chapter": 14,
    "shlok": 19,
    "text": """नान्यं गुणेभ्य: कर्तारं यदा द्रष्टानुपश्यति ।
गुणेभ्यश्च परं वेत्ति मद्भावं सोऽधिगच्छति ॥19॥
""",
  },
  {
    "chapter": 14,
    "shlok": 20,
    "text": """गुणानेतानतीत्य त्रीन्देही देहसमुद्भवान् ।
जन्ममृत्युजरादुःखैर्विमुक्तोऽमृतमश्रुते ॥20॥
""",
  },
  {
    "chapter": 14,
    "shlok": 21,
    "text": """अर्जुन उवाच ।
कैर्लिङ्गैस्त्रीन्गुणानेतानतीतो भवति प्रभो ।
किमाचार: कथं चैतांस्त्रीन्गुणानतिवर्तते ॥21॥
""",
  },
  {
    "chapter": 14,
    "shlok": 22,
    "text": """श्रीभगवानुवाच।
प्रकाशं च प्रवृत्तिं च मोहमेव च पाण्डव ।
न द्वेष्टि सम्प्रवृत्तानि न निवृत्तानि काङ्क्षति ॥22॥
""",
  },
  {
    "chapter": 14,
    "shlok": 23,
    "text": """उदासीनवदासीनो गुणैर्यो न विचाल्यते ।
गुणा वर्तन्त इत्येवं योऽवतिष्ठति नेङ्गते ॥23॥
""",
  },
  {
    "chapter": 14,
    "shlok": 24,
    "text": """समदु:खसुख: स्वस्थ: समलोष्टाश्मकाञ्चन: ।
तुल्यप्रियाप्रियो धीरस्तुल्यनिन्दात्मसंस्तुति: ॥24॥
""",
  },
  {
    "chapter": 14,
    "shlok": 25,
    "text": """मानापमानयोस्तुल्यस्तुल्यो मित्रारिपक्षयो: ।
सर्वारम्भपरित्यागी गुणातीत: स उच्यते ॥25॥
""",
  },
  {
    "chapter": 14,
    "shlok": 26,
    "text": """मां च योऽव्यभिचारेण भक्तियोगेन सेवते ।
स गुणान्समतीत्यैतान्ब्रह्मभूयाय कल्पते ॥26॥
""",
  },
  {
    "chapter": 14,
    "shlok": 27,
    "text": """ब्रह्मणो हि प्रतिष्ठाहममृतस्याव्ययस्य च ।
शाश्वतस्य च धर्मस्य सुखस्यैकान्तिकस्य च ॥27॥
""",
  },
];
