final List<Map<String, dynamic>> geeta_05 = [
  {
    "chapter": 05,
    "shlok": 01,
    "text": """अर्जुन उवाच ।
संन्यासं कर्मणां कृष्ण पुनर्योगं च शंससि ।
यच्छ्रेय एतयोरेकं तन्मे ब्रूहि सुनिश्चितम् ॥1॥
""",
  },
  {
    "chapter": 05,
    "shlok": 02,
    "text": """श्रीभगवानुवाच ।
संन्यास: कर्मयोगश्च नि:श्रेयसकरावुभौ ।
तयोस्तु कर्मसंन्यासात्कर्मयोगो विशिष्यते ॥2॥
""",
  },
  {
    "chapter": 05,
    "shlok": 03,
    "text": """ज्ञेय: स नित्यसंन्यासी यो न द्वेष्टि न काङ् क्षति ।
निर्द्वन्द्वो हि महाबाहो सुखं बन्धात्प्रमुच्यते ॥3॥
""",
  },
  {
    "chapter": 05,
    "shlok": 04,
    "text": """साङ्ख्ययोगौ पृथग्बाला: प्रवदन्ति न पण्डिता: ।
एकमप्यास्थित: सम्यगुभयोर्विन्दते फलम् ॥4॥
""",
  },
  {
    "chapter": 05,
    "shlok": 05,
    "text": """यत्साङ्ख्यै: प्राप्यते स्थानं तद्योगैरपि गम्यते ।
एकं साङ्ख्यं च योगं च य: पश्यति स पश्यति ॥5॥
""",
  },
  {
    "chapter": 05,
    "shlok": 06,
    "text": """संन्यासस्तु महाबाहो दु:खमाप्तुमयोगत: ।
योगयुक्तो मुनिर्ब्रह्म नचिरेणाधिगच्छति ॥6॥
""",
  },
  {
    "chapter": 05,
    "shlok": 07,
    "text": """योगयुक्तो विशुद्धात्मा विजितात्मा जितेन्द्रिय: ।
सर्वभूतात्मभूतात्मा कुर्वन्नपि न लिप्यते ॥7॥
""",
  },
  {
    "chapter": 05,
    "shlok": 08,
    "text": """नैव किञ्चित्करोमीति युक्तो मन्येत तत्त्ववित् ।
पश्यञ्शृण्वन्स्पृशञ्जिघ्रन्नश्नन्गच्छन्स्वपञ्श्वसन् ॥8॥
""",
  },
  {
    "chapter": 05,
    "shlok": 09,
    "text": """प्रलपन्विसृजन्गृह्ण्न्नुन्मिषन्निमिषन्नपि ।
इन्द्रियाणीन्द्रियार्थेषु वर्तन्त इति धारयन् ॥9॥
""",
  },
  {
    "chapter": 05,
    "shlok": 10,
    "text": """ब्रह्मण्याधाय कर्माणि सऊं त्यक्त्वा करोति यः ।
लिप्यते न स पापेन पद्मपत्रमिवाम्भसा ॥10॥
""",
  },
  {
    "chapter": 05,
    "shlok": 11,
    "text": """कायेन मनसा बुद्ध्या केवलैरिन्द्रियैरपि ।
योगिन: कर्म कुर्वन्ति सङ्गं त्यक्त्वात्मशुद्धये ॥11॥
""",
  },
  {
    "chapter": 05,
    "shlok": 12,
    "text": """युक्तः कर्मफलं त्यक्त्वा शान्तिमाप्नोति नैष्ठिकीम् ।
अयुक्तः कामकारेण फले सक्तो निबध्यते ॥12॥
""",
  },
  {
    "chapter": 05,
    "shlok": 13,
    "text": """सर्वकर्माणि मनसा संन्यस्यास्ते सुखं वशी ।
नवद्वारे पुरे देही नैव कुर्वन्न कारयन् ॥13॥
""",
  },
  {
    "chapter": 05,
    "shlok": 14,
    "text": """न कर्तृत्वं न कर्माणि लोकस्य सृजति प्रभुः ।
न कमर्फलसंयोगं स्वभावस्तु प्रवर्तते ॥14॥
""",
  },
  {
    "chapter": 05,
    "shlok": 15,
    "text": """नादत्ते कस्यचित्पापं न चैव सुकृतं विभु: ।
अज्ञानेनावृतं ज्ञानं तेन मुह्यन्ति जन्तव: ॥15॥
""",
  },
  {
    "chapter": 05,
    "shlok": 16,
    "text": """ज्ञानेन तु तदज्ञानं येषां नाशितमात्मनः।
तेषामादित्यवज्ज्ञानं प्रकाशयति तत्परम् ॥16॥
""",
  },
  {
    "chapter": 05,
    "shlok": 17,
    "text": """तद्बुद्धयस्तदात्मानस्तन्निष्ठास्तत्परायणा: ।
गच्छन्त्यपुनरावृत्तिं ज्ञाननिर्धूतकल्मषा: ॥17॥
""",
  },
  {
    "chapter": 05,
    "shlok": 18,
    "text": """विद्याविनयसम्पन्ने ब्राह्मणे गवि हस्तिनि ।
शुनि चैव श्वपाके च पण्डिताः समदर्शिनः ॥18॥
""",
  },
  {
    "chapter": 05,
    "shlok": 19,
    "text": """इहैव तैर्जित: सर्गो येषां साम्ये स्थितं मन: ।
निर्दोषं हि समं ब्रह्म तस्माद् ब्रह्मणि ते स्थिता: ॥19॥
""",
  },
  {
    "chapter": 05,
    "shlok": 20,
    "text": """न प्रहृष्येत्प्रियं प्राप्य नोद्विजेत्प्राप्य चाप्रियम् ।
स्थिरबुद्धिरसम्मूढो ब्रह्मविद् ब्रह्मणि स्थितः ॥20॥
""",
  },
  {
    "chapter": 05,
    "shlok": 21,
    "text": """बाह्यस्पर्शेष्वसक्तात्मा विन्दत्यात्मनि यत्सुखम् ।
स ब्रह्मयोगयुक्तात्मा सुखमक्षयमश्नुते ॥21॥
""",
  },
  {
    "chapter": 05,
    "shlok": 22,
    "text": """ये हि संस्पर्शजा भोगा दुःखयोनय एव ते ।
आद्यन्तवन्तः कौन्तेय न तेषु रमते बुधः ॥22॥
""",
  },
  {
    "chapter": 05,
    "shlok": 23,
    "text": """शक्नोतीहैव य: सोढुं प्राक्शरीरविमोक्षणात् ।
कामक्रोधोद्भवं वेगं स युक्त: स सुखी नर: ॥23॥
""",
  },
  {
    "chapter": 05,
    "shlok": 24,
    "text": """योऽन्तःसुखोऽन्तरारामस्तथान्तर्योतिरेव यः।
स योगी ब्रह्मनिर्वाणं ब्रह्मभूतोऽधिगच्छति ॥24॥
""",
  },
  {
    "chapter": 05,
    "shlok": 25,
    "text": """लभन्ते ब्रह्मनिर्वाणमृषय: क्षीणकल्मषा: ।
छिन्नद्वैधा यतात्मान: सर्वभूतहिते रता: ॥25॥
""",
  },
  {
    "chapter": 05,
    "shlok": 26,
    "text": """कामक्रोधवियुक्तानां यतीनां यतचेतसाम्।
अभितो ब्रह्मनिर्वाणं वर्तते विदितात्मनाम् ॥26॥
""",
  },
  {
    "chapter": 05,
    "shlok": 27,
    "text": """स्पर्शान्कृत्वा बहिर्बाह्यांश्चक्षुश्चैवान्तरे भ्रुवो: ।
प्राणापानौ समौ कृत्वा नासाभ्यन्तरचारिणौ ॥27॥
""",
  },
  {
    "chapter": 05,
    "shlok": 28,
    "text": """यतेन्द्रियमनोबुद्धिर्मुनिर्मोक्षपरायण: ।
विगतेच्छाभयक्रोधो य: सदा मुक्त एव स: ॥28॥
""",
  },
  {
    "chapter": 05,
    "shlok": 29,
    "text": """भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम् ।
सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति ॥29॥
""",
  },
];
