final List<Map<String, dynamic>> geeta_10 = [
  {
    "chapter": 10,
    "shlok": 01,
    "text": """श्रीभगवानुवाच ।
भूय एव महाबाहो शृणु मे परमं वच: ।
यत्तेऽहं प्रीयमाणाय वक्ष्यामि हितकाम्यया ॥1॥
""",
  },
  {
    "chapter": 10,
    "shlok": 02,
    "text": """न मे विदुः सुरगणाः प्रभवं न महर्षयः ।
अहमादिहि देवानां महर्षीणां च सर्वशः ॥2॥
""",
  },
  {
    "chapter": 10,
    "shlok": 03,
    "text": """यो मामजमनादिं च वेत्ति लोकमहेश्वरम् ।
असम्मूढः स मर्येषु सर्वपापैः प्रमुच्यते ॥3॥
""",
  },
  {
    "chapter": 10,
    "shlok": 04,
    "text": """बुद्धिर्ज्ञानमसम्मोहः क्षमा सत्यं दमः शमः ।
सुखं दुःखं भवोऽभावो भयं चाभ्यमेव च ॥4॥
""",
  },
  {
    "chapter": 10,
    "shlok": 05,
    "text": """अहिंसा समता तुष्टिस्तपो दानं यशोऽयशः ।
भवन्ति भावा भूतानां मत्त एव पृथग्विधाः ॥5॥
""",
  },
  {
    "chapter": 10,
    "shlok": 06,
    "text": """महर्षयः सप्त पूर्वे चत्वारो मनवस्तथा ।
मद्भावा मानसा जाता येषां लोक इमाः प्रजाः ॥6॥
""",
  },
  {
    "chapter": 10,
    "shlok": 07,
    "text": """विभूति योग एतां विभूतिं योगं च मम यो वेत्ति तत्त्वतः।
सोऽविकल्पेन योगेन युज्यते नात्र संशयः ॥7॥
""",
  },
  {
    "chapter": 10,
    "shlok": 08,
    "text": """अहं सर्वस्य प्रभवो मत्तः सर्वं प्रवर्तते ।
इति मत्वा भजन्ते मां बुधा भावसमन्विताः ॥8॥
""",
  },
  {
    "chapter": 10,
    "shlok": 09,
    "text": """मच्चित्ता मद्गतप्राणा बोधयन्तः परस्परम् ।
कथयन्तश्च मां नित्यं तुष्यन्ति च रमन्ति च ॥9॥
""",
  },
  {
    "chapter": 10,
    "shlok": 10,
    "text": """तेषां सततयुक्तानां भजतां प्रीतिपूर्वकम् ।
ददामि बुद्धियोगं तं येन मामुपयान्ति ते ॥10॥
""",
  },
  {
    "chapter": 10,
    "shlok": 11,
    "text": """तेषामेवानुकम्पार्थमहमज्ञानजं तमः ।
नाशयाम्यात्मभावस्थो ज्ञानदीपेन भास्वता ॥11॥
""",
  },
  {
    "chapter": 10,
    "shlok": 12,
    "text": """अर्जुन उवाच। परं ब्रह्म परं धाम पवित्रं परमं भवान् ।
पुरुषं शाश्वतं दिव्यमादिदेवमजं विभुम् ॥12॥
""",
  },
  {
    "chapter": 10,
    "shlok": 13,
    "text": """आहुस्त्वामृषयः सर्वे देवर्षि रदस्तथा।
असितो देवलो व्यासः स्वयं चैव ब्रवीषि मे ॥13॥
""",
  },
  {
    "chapter": 10,
    "shlok": 14,
    "text": """सर्वमेतदृतं मन्ये यन्मां वदसि केशव।
न हि ते भगवन्व्यक्तिं विदुर्देवा न दानवाः ॥14॥
""",
  },
  {
    "chapter": 10,
    "shlok": 15,
    "text": """स्वयमेवात्मनात्मानं वेत्थ त्वं पुरुषोत्तम ।
भूतभावन भूतेश देवदेव जगत्पते ॥15॥
""",
  },
  {
    "chapter": 10,
    "shlok": 16,
    "text": """वक्तुमर्हस्यशेषेण दिव्या ह्यात्मविभूतयः।
याभिर्विभूतिभिर्लोकानिमांस्त्वं व्याप्य तिष्ठसि ॥16॥
""",
  },
  {
    "chapter": 10,
    "shlok": 17,
    "text": """कथं विद्यामहं योगिंस्त्वां सदा परिचिन्तयन्।
केषु केषु च भावेषु चिन्त्योऽसि भगवन्मया ॥17॥
""",
  },
  {
    "chapter": 10,
    "shlok": 18,
    "text": """विस्तरेणात्मनो योगं विभूतिं च जनार्दन ।
भूयः कथय तृप्तिर्हि शृण्वतो नास्ति मेऽमृतम् ॥18॥
""",
  },
  {
    "chapter": 10,
    "shlok": 19,
    "text": """श्रीभगवानुवाच।
हन्त ते कथयिष्यामि दिव्या ह्यात्मविभूतयः ।
प्राधान्यतः कुरुश्रेष्ठ नास्त्यन्तो विस्तरस्य मे ॥19॥
""",
  },
  {
    "chapter": 10,
    "shlok": 20,
    "text": """अहमात्मा गुडाकेश सर्वभूताशयस्थितः ।
अहमादिश्च मध्यं च भूतानामन्त एव च ॥20॥
""",
  },
  {
    "chapter": 10,
    "shlok": 21,
    "text": """आदित्यानामहं विष्णुर्योतिषां रविरंशुमान्।
मरीचिर्मरुतामस्मि नक्षत्राणामहं शशी ॥21॥
""",
  },
  {
    "chapter": 10,
    "shlok": 22,
    "text": """वेदानां सामवेदोऽस्मि देवानामस्मि वासवः।
इन्द्रियाणां मनश्चास्मि भूतानामस्मि चेतना ॥22॥
""",
  },
  {
    "chapter": 10,
    "shlok": 23,
    "text": """रुद्राणां शङ्करश्चास्मि वित्तेशो यक्षरक्षसाम्।
वसूनां पावकश्चास्मि मेरुः शिखरिणामहम् ॥23॥
""",
  },
  {
    "chapter": 10,
    "shlok": 24,
    "text": """पुरोधसां च मुख्यं मां विद्धि पार्थ बृहस्पतिम् ।
सेनानीनामहं स्कन्दः सरसामस्मि सागरः ॥24॥
""",
  },
  {
    "chapter": 10,
    "shlok": 25,
    "text": """महर्षीणां भृगुरहं गिरामरम्येकमक्षरम् ।
यज्ञानां जपयज्ञोऽस्मि स्थावराणां हिमालयः ॥25॥
""",
  },
  {
    "chapter": 10,
    "shlok": 26,
    "text": """अश्वत्थः सर्ववृक्षाणां देवर्षीणां च नारदः ।
गन्धर्वाणां चित्ररथः सिद्धानां कपिलो मुनिः ॥26॥
""",
  },
  {
    "chapter": 10,
    "shlok": 27,
    "text": """उच्चैः श्रवसमश्वानां विद्धि माममृतोद्भवम् ।
ऐरावतं गजेन्द्राणां नराणां च नराधिपम् ॥27॥
""",
  },
  {
    "chapter": 10,
    "shlok": 28,
    "text": """आयुधानामहं वज्रं धेनूनामस्मि कामधुक्।
प्रजनश्चास्मि कन्दर्पः सर्पाणामस्मि वासुकिः ॥28॥
""",
  },
  {
    "chapter": 10,
    "shlok": 29,
    "text": """अनन्तश्चास्मि नागानां वरुणो यादसामहम् ।
पितॄणामर्यमा चास्मि यमः संयमतामहम् ॥29॥
""",
  },
  {
    "chapter": 10,
    "shlok": 30,
    "text": """प्रह्लादश्चास्मि दैत्यानां कालः कलयतामहम् ।
मृगाणां च मृगेन्द्रोऽहं वैनतेयश्च पक्षिणाम् ॥30॥
""",
  },
  {
    "chapter": 10,
    "shlok": 31,
    "text": """पवनः पवतामस्मि रामः शस्त्रभृतामहम्।
झषाणां मकरश्चास्मि स्त्रोतसामस्मि जाह्नवी ॥31॥
""",
  },
  {
    "chapter": 10,
    "shlok": 32,
    "text": """सर्गाणामादिरन्तश्च मध्यं चैवाहमर्जुन ।
अध्यात्मविद्या विद्यानां वादः प्रवदतामहम् ॥32॥
""",
  },
  {
    "chapter": 10,
    "shlok": 33,
    "text": """अक्षराणामकारोऽस्मि द्वन्द्वः सामासिकस्य च।
अहमेवाक्षयः कालो धाताहं विश्वतोमुखः ॥33॥
""",
  },
  {
    "chapter": 10,
    "shlok": 34,
    "text": """मृत्युः सर्वहरश्चाहमुद्भवश्च भविष्यताम् ।
कीर्तिः श्रीर्वाक्च नारीणां स्मृतिर्मेधा धृतिः क्षमा ॥34॥
""",
  },
  {
    "chapter": 10,
    "shlok": 35,
    "text": """बृहत्साम तथा साम्नां गायत्री छन्दसामहम् ।
मासानां मार्गशीर्षोऽहमृतूनां कुसुमाकरः ॥35॥
""",
  },
  {
    "chapter": 10,
    "shlok": 36,
    "text": """द्यूतं छलयतामस्मि तेजस्तेजस्विनामहम्।
जयोऽस्मि व्यवसायोऽस्मि सत्त्वं सत्त्ववतामहम् ॥36॥
""",
  },
  {
    "chapter": 10,
    "shlok": 37,
    "text": """वृष्णीनां वासुदेवोऽस्मि पाण्डवानां धनञ्जयः ।
मुनीनामप्यहं व्यासः कवीनामुशना कविः ॥37॥
""",
  },
  {
    "chapter": 10,
    "shlok": 38,
    "text": """दण्डो दमयतामस्मि नीतिरस्मि जिगीषताम् ।
मौनं चैवास्मि गुह्यानां ज्ञानं ज्ञानवतामहम् ॥38॥
""",
  },
  {
    "chapter": 10,
    "shlok": 39,
    "text": """यच्चापि सर्वभूतानां बीजं तदहमर्जुन।
न तदस्ति विना यत्स्यान्मया भूतं चराचरम् ॥39॥
""",
  },
  {
    "chapter": 10,
    "shlok": 40,
    "text": """नान्तोऽस्ति मम दिव्यानां विभूतीनां परन्तप ।
एष तूद्देशतः प्रोक्तो विभूतेर्विस्तरो मया ॥40॥
""",
  },
  {
    "chapter": 10,
    "shlok": 41,
    "text": """यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा।
तत्तदेवावगच्छ त्वं मम तेजोंऽशसम्भवम् ॥41॥
""",
  },
  {
    "chapter": 10,
    "shlok": 42,
    "text": """अथवा बहुनैतेन किं ज्ञातेन तवार्जुन ।
विष्टभ्याहमिदं कृत्स्नमेकांशेन स्थितो जगत् ॥42॥
""",
  },
];
