final List<Map<String, dynamic>> geeta_12 = [
  {
    "chapter": 12,
    "shlok": 01,
    "text": """अर्जुन उवाच।
एवं सततयुक्ता ये भक्तास्त्वां पर्युपासते।
ये चाप्यक्षरमव्यक्तं तेषां के योगवित्तमाः ॥1॥
""",
  },
  {
    "chapter": 12,
    "shlok": 02,
    "text": """श्रीभगवानुवाच।
मय्यावेश्य मनो ये मां नित्ययुक्ता उपासते ।
श्रद्धया परयोपेतास्ते मे युक्ततमा मताः ॥2॥
""",
  },
  {
    "chapter": 12,
    "shlok": 03,
    "text": """ये त्वक्षरमनिर्देश्यमव्यक्तं पर्युपासते ।
सर्वत्रगमचिन्त्यञ्च कूटस्थमचलन्ध्रुवम् ॥3॥
""",
  },
  {
    "chapter": 12,
    "shlok": 04,
    "text": """सन्नियम्येन्द्रियग्रामं सर्वत्र समबुद्धयः ।
ते प्राप्नुवन्ति मामेव सर्वभूतहिते रताः ॥4॥
""",
  },
  {
    "chapter": 12,
    "shlok": 05,
    "text": """क्लेशोऽधिकतरस्तेषामव्यक्तासक्तचेतसाम् ।
अव्यक्ता हि गतिर्दुःखं देहवद्भिरवाप्यते ॥5॥
""",
  },
  {
    "chapter": 12,
    "shlok": 06,
    "text": """ये तु सर्वाणि कर्माणि मयि संत्र्यस्य मत्परः।
अनन्येनैव योगेन मां ध्यायन्त उपासते ॥6॥
""",
  },
  {
    "chapter": 12,
    "shlok": 07,
    "text": """तेषामहं समुद्धर्ता मृत्युसंसारसागरात्।
भवामि नचिरात्पार्थ मय्यावेशितचेतसाम् ॥7॥
""",
  },
  {
    "chapter": 12,
    "shlok": 08,
    "text": """मय्येव मन आधत्स्व मयि बुद्धिं निवेशय ।
निवसिष्यसि मय्येव अत ऊर्ध्वं न संशयः ॥8॥
""",
  },
  {
    "chapter": 12,
    "shlok": 09,
    "text": """अथ चित्तं समाधातुं न शक्नोषि मयि स्थिरम् ।
अभ्यासयोगेन ततो मामिच्छाप्तुं धनञ्जय ॥9॥
""",
  },
  {
    "chapter": 12,
    "shlok": 10,
    "text": """अभ्यासेऽप्यसमर्थोऽसि मत्कर्मपरमो भव ।।
मदर्थमपि कर्माणि कुर्वन्सिद्धिमवाप्स्यसि ॥10॥
""",
  },
  {
    "chapter": 12,
    "shlok": 11,
    "text": """अथैतदप्यशक्तोऽसि कर्तुं मद्योगमाश्रितः ।
सर्वकर्मफलत्यागं ततः कुरु यतात्मवान् ॥11॥
""",
  },
  {
    "chapter": 12,
    "shlok": 12,
    "text": """श्रेयो हि ज्ञानमभ्यासाज्ज्ञानाद्धयानं विशिष्यते ।
ध्यानात्कर्मफलत्यागस्त्यागाच्छान्तिरनन्तरम् ॥12॥
""",
  },
  {
    "chapter": 12,
    "shlok": 13,
    "text": """अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च ।
निर्ममो निरहङ्कारः समदुःखसुखः क्षमी ॥13॥
""",
  },
  
  {
    "chapter": 12,
    "shlok": 14,
    "text": """संतुष्टः सततं योगी यतात्मा दृढनिश्चयः ।
मय्यर्पितमनोबुद्धिर्यो मद्भक्तः स मे प्रियः ॥14॥
""",
  },
  {
    "chapter": 12,
    "shlok": 15,
    "text": """यस्मान्नोद्विजते लोको लोकानोद्विजते च यः ।
हर्षामर्षभयोद्वेगैर्मुक्तो यः स च मे प्रियः ॥15॥
""",
  },
  {
    "chapter": 12,
    "shlok": 16,
    "text": """अनपेक्षः शुचिर्दक्ष उदासीनो गतव्यथः ।
सर्वारम्भपरित्यागी यो मद्भक्तः स मे प्रियः ॥16॥
""",
  },
  {
    "chapter": 12,
    "shlok": 17,
    "text": """यो न हृष्यति न द्वेष्टि न शोचति न काङ् क्षति ।
शुभाशुभपरित्यागी भक्तिमान्य: स मे प्रिय: ॥17॥
""",
  },
  {
    "chapter": 12,
    "shlok": 18,
    "text": """समः शत्रौ च मित्रे च तथा मानापमानयोः ।
शीतोष्णसुखदुःखेषु समः सङ्गविवर्जितः ॥18॥
""",
  },
  {
    "chapter": 12,
    "shlok": 19,
    "text": """तुल्यनिन्दास्तुतिमौनी सन्तुष्टो येन केनचित् ।
अनिकेतः स्थिरमतिर्भक्तिमान्मे प्रियो नरः ॥19॥
""",
  },
  {
    "chapter": 12,
    "shlok": 20,
    "text": """ये तु धामृतमिदं यथोक्तं पर्युपासते ।
श्रद्दधाना मत्परमा भक्तास्तेऽतीव मे प्रियाः ॥20॥
""",
  },
];
