final List<Map<String, dynamic>> geeta_07 = [
  {
    "chapter": 07,
    "shlok": 01,
    "text": """श्रीभगवान उवाच।
मय्यासक्तमनाः पार्थ योगं युञ्जन्मदाश्रयः ।
असंशयं समग्रं मां यथा ज्ञास्यसि तच्छृणु ॥1॥
""",
  },
  {
    "chapter": 07,
    "shlok": 02,
    "text": """ज्ञानं तेऽहं सविज्ञानमिदं वक्ष्याम्यशेषत: |
यज्ज्ञात्वा नेह भूयोऽन्यज्ज्ञातव्यमवशिष्यते ॥2॥
""",
  },
  {
    "chapter": 07,
    "shlok": 03,
    "text": """मनुष्याणां सहस्त्रेषु कश्चिद्यतति सिद्धये।
यततामपि सिद्धानां कश्चिन्मां वेत्ति तत्त्वतः ॥3॥
""",
  },
  {
    "chapter": 07,
    "shlok": 04,
    "text": """भूमिरापोऽनलो वायु: खं मनो बुद्धिरेव च |
अहङ्कार इतीयं मे भिन्ना प्रकृतिरष्टधा ॥4॥
""",
  },
  {
    "chapter": 07,
    "shlok": 05,
    "text": """अपरेयमितस्त्वन्यां प्रकृतिं विद्धि मे पराम् ।
जीवभूतां महाबाहो ययेदं धार्यते जगत् ॥5॥
""",
  },
  {
    "chapter": 07,
    "shlok": 06,
    "text": """एतद्योनीनि भूतानि सर्वाणीत्युपधारय |
अहं कृत्स्नस्य जगत: प्रभव: प्रलयस्तथा ॥6॥
""",
  },
  {
    "chapter": 07,
    "shlok": 07,
    "text": """मत्तः परतरं नान्यत्किञ्चिदस्ति धनञ्जय ।
मयि सर्वमिदं प्रोतं सूत्रे मणिगणा इव ॥7॥
""",
  },
  {
    "chapter": 07,
    "shlok": 08,
    "text": """रसोऽहमप्सु कौन्तेय प्रभास्मि शशिसूर्ययो: |
प्रणव: सर्ववेदेषु शब्द: खे पौरुषं नृषु ॥8॥
""",
  },
  {
    "chapter": 07,
    "shlok": 09,
    "text": """पुण्यो गन्धः पृथिव्यां च तेजश्चास्मि विभावसौ ।
जीवनं सर्वभूतेषु तपश्चास्मि तपस्विषु ॥9॥
""",
  },
  {
    "chapter": 07,
    "shlok": 10,
    "text": """बीजं मां सर्वभूतानां विद्धि पार्थ सनातनम् |
बुद्धिर्बुद्धिमतामस्मि तेजस्तेजस्विनामहम् ॥10॥
""",
  },
  {
    "chapter": 07,
    "shlok": 11,
    "text": """बलं बलवतां चाहं कामरागविवर्जितम् ।
धर्माविरुद्धो भूतेषु कामोऽस्मि भरतर्षभ ॥11॥
""",
  },
  {
    "chapter": 07,
    "shlok": 12,
    "text": """ये चैव सात्त्विका भावा राजसास्तामसाश्च ये |
मत्त एवेति तान्विद्धि न त्वहं तेषु ते मयि ॥12॥
""",
  },
  {
    "chapter": 07,
    "shlok": 13,
    "text": """त्रिभिर्गुणमयैर्भावैरेभिः सर्वमिदं जगत्।
मोहितं नाभिजानाति मामेभ्यः परमव्ययम् ॥13॥
""",
  },
  {
    "chapter": 07,
    "shlok": 14,
    "text": """दैवी ह्येषा गुणमयी मम माया दुरत्यया |
मामेव ये प्रपद्यन्ते मायामेतां तरन्ति ते ॥14॥
""",
  },
  {
    "chapter": 07,
    "shlok": 15,
    "text": """न मां दुष्कृतिनो मूढाः प्रपद्यन्ते नराधमाः ।
माययापहृतज्ञाना आसुरं भावमाश्रिताः ॥15॥
""",
  },
  {
    "chapter": 07,
    "shlok": 16,
    "text": """चतुर्विधा भजन्ते मां जना: सुकृतिनोऽर्जुन |
आर्तो जिज्ञासुरर्थार्थी ज्ञानी च भरतर्षभ ॥16॥
""",
  },
  {
    "chapter": 07,
    "shlok": 17,
    "text": """तेषां ज्ञानी नित्ययुक्त एकभक्तिर्विशिष्यते ।
प्रियो हि ज्ञानिनोऽत्यर्थमहं स च मम प्रियः ॥17॥
""",
  },
  {
    "chapter": 07,
    "shlok": 18,
    "text": """उदारा: सर्व एवैते ज्ञानी त्वात्मैव मे मतम् |
आस्थित: स हि युक्तात्मा मामेवानुत्तमां गतिम् ॥18॥
""",
  },
  {
    "chapter": 07,
    "shlok": 19,
    "text": """बहूनां जन्मनामन्ते ज्ञानवान्मां प्रपद्यते।
वासुदेवः सर्वमिति स महात्मा सुदुर्लभः ॥19॥
""",
  },
  {
    "chapter": 07,
    "shlok": 20,
    "text": """कामैस्तैस्तैर्हृतज्ञाना: प्रपद्यन्तेऽन्यदेवता: |
तं तं नियममास्थाय प्रकृत्या नियता: स्वया ॥20॥
""",
  },
  {
    "chapter": 07,
    "shlok": 21,
    "text": """यो यो यां यां तनुं भक्तः श्रद्धयार्चितुमिच्छति ।
तस्य तस्याचलां श्रद्धां तामेव विदधाम्यहम् ॥21॥
""",
  },
  {
    "chapter": 07,
    "shlok": 22,
    "text": """स तया श्रद्धया युक्तस्तस्याराधनमीहते |
लभते च तत: कामान्मयैव विहितान्हि तान् ॥22॥
""",
  },
  {
    "chapter": 07,
    "shlok": 23,
    "text": """अन्तवत्तु फलं तेषां तद्भवत्यल्पमेधसाम् ।
देवान्देवयजो यान्ति मद्भक्ता यान्ति मामपि ॥23॥
""",
  },
  {
    "chapter": 07,
    "shlok": 24,
    "text": """अव्यक्तं व्यक्तिमापन्नं मन्यन्ते मामबुद्धयः ।
परं भावमजानन्तो ममाव्ययमनुत्तमम् ॥24॥
""",
  },
  {
    "chapter": 07,
    "shlok": 25,
    "text": """नाहं प्रकाश: सर्वस्य योगमायासमावृत: |
मूढोऽयं नाभिजानाति लोको मामजमव्ययम् ॥25॥
""",
  },
  {
    "chapter": 07,
    "shlok": 26,
    "text": """वेदाहं समतीतानि वर्तमानानि चार्जुन ।
भविष्याणि च भूतानि मां तु वेद न कश्चन ॥26॥
""",
  },
  {
    "chapter": 07,
    "shlok": 27,
    "text": """इच्छाद्वेषसमुत्थेन द्वन्द्वमोहेन भारत |
सर्वभूतानि सम्मोहं सर्गे यान्ति परन्तप ॥27॥
""",
  },
  {
    "chapter": 07,
    "shlok": 28,
    "text": """येषां त्वन्तगतं पापं जनानां पुण्यकर्मणाम् ।
ते द्वन्द्वमोहनिर्मुक्ता भजन्ते मां दृढव्रताः ॥28॥
""",
  },
  {
    "chapter": 07,
    "shlok": 29,
    "text": """जरामरणमोक्षाय मामाश्रित्य यतन्ति ये |
ते ब्रह्म तद्विदु: कृत्स्नमध्यात्मं कर्म चाखिलम् ॥29॥
""",
  },
  {
    "chapter": 07,
    "shlok": 30,
    "text": """साधिभूताधिदैवं मां साधियज्ञं च ये विदुः ।
प्रयाणकालेऽपि च मां ते विदुर्युक्तचेतसः ॥30॥
""",
  },
];
