final List<Map<String, dynamic>> geeta_03 = [
  {
    "chapter": 03,
    "shlok": 01,
    "text": """अर्जुन उवाच ।
ज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन ।
तत्किं कर्मणि घोरे मां नियोजयसि केशव ॥1॥

""",
  },
  {
    "chapter": 03,
    "shlok": 02,
    "text": """व्यामिश्रेणेव वाक्येन बुद्धिं मोहयसीव मे ।
तदेकं वद निश्चित्य येन श्रेयोऽहमाप्नुयाम् ॥2॥
""",
  },
  {
    "chapter": 03,
    "shlok": 03,
    "text": """श्रीभगवानुवाच।
लोकेऽस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ ।
ज्ञानयोगेन साङ्ख्यानां कर्मयोगेन योगिनाम् ॥3॥
""",
  },
  {
    "chapter": 03,
    "shlok": 04,
    "text": """न कर्मणामनारम्भान्नैष्कर्म्यं पुरुषोऽश्नुते ।
न च संन्यसनादेव सिद्धिं समधिगच्छति ॥4॥
""",
  },
  {
    "chapter": 03,
    "shlok": 05,
    "text": """न हि कश्चित्क्षणमपि जातु तिष्ठत्यकर्मकृत् ।
कार्यते ह्यवशः कर्म सर्वः प्रकृतिजैर्गुणैः ॥5॥
""",
  },
  {
    "chapter": 03,
    "shlok": 06,
    "text": """कर्मेन्द्रियाणि संयम्य य आस्ते मनसा स्मरन् ।
इन्द्रियार्थान्विमूढात्मा मिथ्याचार: स उच्यते ॥6॥
""",
  },
  {
    "chapter": 03,
    "shlok": 07,
    "text": """यस्त्विन्द्रियाणि मनसा नियम्यारभतेऽर्जुन।
कर्मेन्द्रियैः कर्मयोगमसक्तः स विशिष्यते ॥7॥
""",
  },
  {
    "chapter": 03,
    "shlok": 08,
    "text": """नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मण: ।
शरीरयात्रापि च ते न प्रसिद्ध्येदकर्मण: ॥8॥
""",
  },
  {
    "chapter": 03,
    "shlok": 09,
    "text": """यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः
तदर्थं कर्म कौन्तेय मुक्तसङ्गः समाचर ॥9॥
""",
  },
  {
    "chapter": 03,
    "shlok": 10,
    "text": """सहयज्ञा: प्रजा: सृष्ट्वा पुरोवाच प्रजापति: ।
अनेन प्रसविष्यध्वमेष वोऽस्त्विष्टकामधुक् ॥10॥
""",
  },
  {
    "chapter": 03,
    "shlok": 11,
    "text": """देवान्भावयतानेन ते देवा भावयन्तु वः ।
परस्परं भावयन्तः श्रेयः परमवाप्स्यथ ॥11॥
""",
  },
  {
    "chapter": 03,
    "shlok": 12,
    "text": """इष्टान्भोगान्हि वो देवा दास्यन्ते यज्ञभाविता: ।
तैर्दत्तानप्रदायैभ्यो यो भुङ्क्ते स्तेन एव स: ॥12॥
""",
  },
  {
    "chapter": 03,
    "shlok": 13,
    "text": """यज्ञशिष्टाशिनः सन्तो मुच्यन्ते सर्वकिल्बिषैः ।
भुज्यते ते त्वघं पापा ये पचन्त्यात्मकारणात् ॥13॥
""",
  },
  {
    "chapter": 03,
    "shlok": 14,
    "text": """अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भव: ।
यज्ञाद्भवति पर्जन्यो यज्ञ: कर्मसमुद्भव: ॥14॥
""",
  },
  {
    "chapter": 03,
    "shlok": 15,
    "text": """कर्म ब्रह्मोद्भवं विद्धि ब्रह्माक्षरसमुद्भवम् ।
तस्मात्सर्वगतं ब्रह्म नित्यं यज्ञे प्रतिष्ठितम् ॥15॥
""",
  },
  {
    "chapter": 03,
    "shlok": 16,
    "text": """एवं प्रवर्तितं चक्रं नानुवर्तयतीह यः ।
अघायुरिन्द्रियारामो मोघं पार्थ स जीवति ॥16॥
""",
  },
  {
    "chapter": 03,
    "shlok": 17,
    "text": """यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानव: ।
आत्मन्येव च सन्तुष्टस्तस्य कार्यं न विद्यते ॥17॥
""",
  },
  {
    "chapter": 03,
    "shlok": 18,
    "text": """नैव तस्य कृतेनार्थो नाकृतेनेह कश्चन ।
न चास्य सर्वभूतेषु कश्चिदर्थव्यपाश्रयः ॥18॥
""",
  },
  {
    "chapter": 03,
    "shlok": 19,
    "text": """तस्मादसक्त: सततं कार्यं कर्म समाचर ।
असक्तो ह्याचरन्कर्म परमाप्नोति पूरुष: ॥19॥
""",
  },
  {
    "chapter": 03,
    "shlok": 20,
    "text": """कर्मणैव हि संसिद्धिमास्थिता जनकादयः ।
लोकसंग्रहमेवापि सम्पश्यन्कर्तुमर्हसि ॥20॥
""",
  },
  {
    "chapter": 03,
    "shlok": 21,
    "text": """यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः ।
स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते ॥21॥
""",
  },
  {
    "chapter": 03,
    "shlok": 22,
    "text": """न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किञ्चन ।
नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि ॥22॥
""",
  },
  {
    "chapter": 03,
    "shlok": 23,
    "text": """यदि ह्यहं न वर्तेयं जातु कर्मण्यतन्द्रितः ।
मम वानुवर्तन्ते मनुष्याः पार्थ सर्वशः ॥23॥
""",
  },
  {
    "chapter": 03,
    "shlok": 24,
    "text": """उत्सीदेयुरिमे लोका न कुर्यां कर्म चेदहम् ।
सङ्करस्य च कर्ता स्यामुपहन्यामिमा: प्रजा: ॥24॥
""",
  },
  {
    "chapter": 03,
    "shlok": 25,
    "text": """सक्ताः कर्मण्यविद्वांसो यथा कुर्वन्ति भारत।
कुर्याद्विद्वांस्तथासक्तश्चिकीर्षुर्लोकसंग्रहम् ॥25॥
""",
  },
  {
    "chapter": 03,
    "shlok": 26,
    "text": """न बुद्धिभेदं जनयेदज्ञानां कर्मसङ्गिनाम् ।
जोषयेत्सर्वकर्माणि विद्वान्युक्त: समाचरन् ॥26॥
""",
  },
  {
    "chapter": 03,
    "shlok": 27,
    "text": """प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः ।
अहङ्कारविमूढात्मा कर्ताहमिति मन्यते ॥27॥
""",
  },
  {
    "chapter": 03,
    "shlok": 28,
    "text": """तत्त्ववित्तु महाबाहो गुणकर्मविभागयो: ।
गुणा गुणेषु वर्तन्त इति मत्वा न सज्जते ॥28॥
""",
  },
  {
    "chapter": 03,
    "shlok": 29,
    "text": """प्रकृतेर्गुणसम्मूढाः सज्जन्ते गुणकर्मसु ।
तानकृत्स्नविदो मन्दान्कृत्स्नविन्न विचालयेत् ॥29॥
""",
  },
  {
    "chapter": 03,
    "shlok": 30,
    "text": """मयि सर्वाणि कर्माणि संन्यस्याध्यात्मचेतसा ।
निराशीर्निर्ममो भूत्वा युध्यस्व विगतज्वर: ॥30॥
""",
  },
  {
    "chapter": 03,
    "shlok": 31,
    "text": """ये मे मतमिदं नित्यमनुतिष्ठन्ति मानवाः।
श्रद्धावन्तोऽनसूयन्तो मुच्यन्ते तेऽपि कर्मभिः ॥31॥
""",
  },
  {
    "chapter": 03,
    "shlok": 32,
    "text": """ये त्वेतदभ्यसूयन्तो नानुतिष्ठन्ति मे मतम् ।
सर्वज्ञानविमूढांस्तान्विद्धि नष्टानचेतस: ॥32॥
""",
  },
  {
    "chapter": 03,
    "shlok": 33,
    "text": """सदृशं चेष्टते स्वस्याः प्रकृतेर्ज्ञानवानपि ।
प्रकृतिं यान्ति भूतानि निग्रहः किं करिष्यति ॥33॥
""",
  },
  {
    "chapter": 03,
    "shlok": 34,
    "text": """इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ ।
तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ ॥34॥
""",
  },
  {
    "chapter": 03,
    "shlok": 35,
    "text": """श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्।
स्वधर्मे निधनं श्रेयः परधर्मो भयावहः ॥35॥
""",
  },
  {
    "chapter": 03,
    "shlok": 36,
    "text": """अर्जुन उवाच ।
अथ केन प्रयुक्तोऽयं पापं चरति पूरुष: ।
अनिच्छन्नपि वार्ष्णेय बलादिव नियोजित: ॥36॥
""",
  },
  {
    "chapter": 03,
    "shlok": 37,
    "text": """श्रीभगवानुवाच। काम एष क्रोध एष रजोगुणसमुद्भवः ।
महाशनो महापाप्मा विद्धयेनमिह वैरिणम् ॥37॥
""",
  },
  {
    "chapter": 03,
    "shlok": 38,
    "text": """धूमेनाव्रियते वह्निर्यथादर्शो मलेन च ।
यथोल्बेनावृतो गर्भस्तथा तेनेदमावृतम् ॥38॥
""",
  },
  {
    "chapter": 03,
    "shlok": 39,
    "text": """आवृतं ज्ञानमेतेन ज्ञानिनो नित्यवैरिणा ।
कामरूपेण कौन्तेय दुष्पूरेणानलेन च ॥39॥
""",
  },
  {
    "chapter": 03,
    "shlok": 40,
    "text": """इन्द्रियाणि मनो बुद्धिरस्याधिष्ठानमुच्यते ।
एतैर्विमोहयत्येष ज्ञानमावृत्य देहिनम् ॥40॥
""",
  },
  {
    "chapter": 03,
    "shlok": 41,
    "text": """तस्मात्त्वमिन्द्रियाण्यादौ नियम्य भरतर्षभ।
पाप्मानं प्रजहि ह्येनं ज्ञानविज्ञाननाशनम् ॥41॥
""",
  },
  {
    "chapter": 03,
    "shlok": 42,
    "text": """इन्द्रियाणि पराण्याहुरिन्द्रियेभ्य: परं मन: ।
मनसस्तु परा बुद्धिर्यो बुद्धे: परतस्तु स: ॥42॥
""",
  },
  {
    "chapter": 03,
    "shlok": 43,
    "text": """एवं बुद्धः परं बुद्ध्वा संस्तभ्यात्मानमात्मना ।
जहि शत्रु महाबाहो कामरूपं दुरासदम् ॥43॥
""",
  },
];
