final List<Map<String, dynamic>> geeta_15 = [
  {
    "chapter": 15,
    "shlok": 01,
    "text": """श्रीभगवानुवाच
ऊर्ध्वमूलमधःशाखमश्वत्थं प्राहुरव्ययम् ।
छन्दांसि यस्य पर्णानि यस्तं वेद स वेदवित् ॥1॥
""",
  },
  {
    "chapter": 15,
    "shlok": 02,
    "text": """ अधश्चोर्ध्वं प्रसृतास्तस्य शाखा
गुणप्रवृद्धा विषयप्रवाला: ।
अधश्च मूलान्यनुसन्ततानि
कर्मानुबन्धीनि मनुष्यलोके ॥2॥
""",
  },
  {
    "chapter": 15,
    "shlok": 03,
    "text": """ न रूपमस्येह तथोपलभ्यते नान्तो न चादिर्न च सम्प्रतिष्टा।
अश्वत्थमेनं सुविरूढमूल-मसङ्गशस्त्रेण दृढेन छित्त्वा ॥3॥
""",
  },
  {
    "chapter": 15,
    "shlok": 04,
    "text": """ततः पदं तत्परिमार्गितव्यं यस्मिन्गता न निवर्तन्ति भूयः।
तमेव चाद्यं पुरुष प्रपद्ये यतः प्रवृत्ति प्रसृता पुराणी ॥4॥
""",
  },
  {
    "chapter": 15,
    "shlok": 05,
    "text": """ निर्मानमोहा जितसङ्गदोषा
अध्यात्मनित्या विनिवृत्तकामा: ।
द्वन्द्वैर्विमुक्ता: सुखदु:खसंज्ञै
र्गच्छन्त्यमूढा: पदमव्ययं तत् ॥5॥
""",
  },
  {
    "chapter": 15,
    "shlok": 06,
    "text": """न तद्भासयते सूर्यो न शशाङ्को न पावक: ।
यद्गत्वा न निवर्तन्ते तद्धाम परमं मम ॥6॥
""",
  },
  {
    "chapter": 15,
    "shlok": 07,
    "text": """ममैवांशो जीवलोके जीवभूतः सनातनः ।
मनःषष्ठानीन्द्रियाणि प्रकृतिस्थानि कर्षति॥7॥
""",
  },
  {
    "chapter": 15,
    "shlok": 08,
    "text": """शरीरं यदवाप्नोति यच्चाप्युत्क्रामतीश्वर: ।
गृहीत्वैतानि संयाति वायुर्गन्धानिवाशयात् ॥8॥
""",
  },
  {
    "chapter": 15,
    "shlok": 09,
    "text": """श्रोत्रं चक्षुः स्पर्शनं च रसनं घ्राणमेव च ।
अधिष्ठाय मनश्चायं विषयानुपसेवते ॥9॥
""",
  },
  {
    "chapter": 15,
    "shlok": 10,
    "text": """उत्क्रामन्तं स्थितं वापि भुञ्जानं वा गुणान्वितम् ।
विमूढा नानुपश्यन्ति पश्यन्ति ज्ञानचक्षुष: ॥10॥
""",
  },
  {
    "chapter": 15,
    "shlok": 11,
    "text": """यतन्तो योगिनश्चैनं पश्यन्त्यात्मन्यवस्थितम्।
यतन्तोऽप्यकृतात्मानो नैनं पश्यन्त्यचेतसः ॥11॥
""",
  },
  {
    "chapter": 15,
    "shlok": 12,
    "text": """यदादित्यगतं तेजो जगद्भासयतेऽखिलम् ।
यच्चन्द्रमसि यच्चाग्नौ तत्तेजो विद्धि मामकम् ॥12॥
""",
  },
  {
    "chapter": 15,
    "shlok": 13,
    "text": """गामाविश्य च भूतानि धारयाम्यहमोजसा।
पुष्णामि चौषधीः सर्वाः सोमो भूत्वा रसात्मकः ॥13॥
""",
  },
  {
    "chapter": 15,
    "shlok": 14,
    "text": """अहं वैश्वानरो भूत्वा प्राणिनां देहमाश्रित: ।
प्राणापानसमायुक्त: पचाम्यन्नं चतुर्विधम् ॥14॥
""",
  },
  {
    "chapter": 15,
    "shlok": 15,
    "text": """सर्वस्य चाहं हृदि सन्निविष्टो मत्तः स्मृतिर्ज्ञानमपोहनं च ।
वेदैश्च सर्वैरहमेव वेद्यो वेदान्तकृद्वेदविदेव चाहम् ॥15॥
""",
  },
  {
    "chapter": 15,
    "shlok": 16,
    "text": """द्वाविमौ पुरुषौ लोके क्षरश्चाक्षर एव च ।
क्षर: सर्वाणि भूतानि कूटस्थोऽक्षर उच्यते ॥16॥
""",
  },
  {
    "chapter": 15,
    "shlok": 17,
    "text": """उत्तमः पुरुषस्त्वन्यः परमात्मेत्युदाहृतः।
यो लोकत्रयमाविश्य बिभर्त्यव्यय ईश्वरः ॥17॥
""",
  },
  {
    "chapter": 15,
    "shlok": 18,
    "text": """यस्मात्क्षरमतीतोऽहमक्षरादपि चोत्तम: ।
अतोऽस्मि लोके वेदे च प्रथित: पुरुषोत्तम: ॥18॥
""",
  },
  {
    "chapter": 15,
    "shlok": 19,
    "text": """यो मामेवमसम्मूढो जानाति पुरुषोत्तमम् ।
स सर्वविद्भजति मां सर्वभावेन भारत ॥19॥
""",
  },
  {
    "chapter": 15,
    "shlok": 20,
    "text": """इति गुह्यतमं शास्त्रमिदमुक्तं मयानघ ।
एतद्बुद्ध्वा बुद्धिमान्स्यात्कृतकृत्यश्च भारत ॥20॥
""",
  },
];
