final List<Map<String, dynamic>> geeta_18 = [
  {
    "chapter": 18,
    "shlok": 01,
    "text": """अर्जुन उवाच ।
सन्न्यासस्य महाबाहो तत्त्वमिच्छामि वेदितुम् ।
त्यागस्य च हृषीकेश पृथक्केशिनिषूदन ॥1॥
""",
  },
  {
    "chapter": 18,
    "shlok": 02,
    "text": """श्रीभगवानुवाच।
काम्यानां कर्मणां न्यासं संन्यासं कवयो विदुः।
सर्वकर्मफलत्यागं प्राहुस्त्यागं विचक्षणाः ॥2॥
""",
  },
  {
    "chapter": 18,
    "shlok": 03,
    "text": """त्याज्यं दोषवदित्येके कर्म प्राहुर्मनीषिण: ।
यज्ञदानतप:कर्म न त्याज्यमिति चापरे ॥3॥
""",
  },
  {
    "chapter": 18,
    "shlok": 04,
    "text": """निश्चयं शृणु मे तत्र त्यागे भरतसत्तम।
त्यागो हि पुरुषव्याघ्र त्रिविधः सम्प्रकीर्तितः ॥4॥
""",
  },
  {
    "chapter": 18,
    "shlok": 05,
    "text": """यज्ञदानतप:कर्म न त्याज्यं कार्यमेव तत् ।
यज्ञो दानं तपश्चैव पावनानि मनीषिणाम् ॥5॥
""",
  },
  {
    "chapter": 18,
    "shlok": 06,
    "text": """एतान्यपित तु कर्माणि सऊं त्यक्त्वा फलानि च ।
कर्तव्यानीति मे पार्थ निश्चितं मतमुत्तमम् ॥6॥
""",
  },
  {
    "chapter": 18,
    "shlok": 07,
    "text": """नियतस्य तु सन्न्यास: कर्मणो नोपपद्यते ।
मोहात्तस्य परित्यागस्तामस: परिकीर्तित: ॥7॥
""",
  },
  {
    "chapter": 18,
    "shlok": 08,
    "text": """दुःखमित्येव यत्कर्म कायक्लेशभयात्त्यजेत्।
स कृत्वा राजसं त्यागं नैव त्यागफलं लभेत् ॥8॥
""",
  },
  {
    "chapter": 18,
    "shlok": 09,
    "text": """कार्यमित्येव यत्कर्म नियतं क्रियतेऽर्जुन ।
सङ्गं त्यक्त्वा फलं चैव स त्याग: सात्त्विको मत: ॥9॥
""",
  },
  {
    "chapter": 18,
    "shlok": 10,
    "text": """न द्वेष्ट्यकुशलं कर्म कुशले नानुषज्जते।
त्यागी सत्त्वसमाविष्टो मेधावी छिन्नसंशयः ॥10॥
""",
  },
  {
    "chapter": 18,
    "shlok": 11,
    "text": """न हि देहभृता शक्यं त्यक्तुं कर्माण्यशेषत: ।
यस्तु कर्मफलत्यागी स त्यागीत्यभिधीयते ॥11॥
""",
  },
  {
    "chapter": 18,
    "shlok": 12,
    "text": """अनिष्टमिष्टं मिश्रं च त्रिविधं कर्मणः फलम्।
भवत्यत्यागिनां प्रेत्य न तु सन्यासिनां क्वचित् ॥12॥
""",
  },
  {
    "chapter": 18,
    "shlok": 13,
    "text": """पञ्चैतानि महाबाहो कारणानि निबोध मे ।
साङ् ख्ये कृतान्ते प्रोक्तानि सिद्धये सर्वकर्मणाम् ॥13॥
""",
  },
  {
    "chapter": 18,
    "shlok": 14,
    "text": """अधिष्ठानं तथा कर्ता करणं च पृथग्विधम्।
विविधाश्च पृथक्चेष्टा दैवं चैवात्र पञ्चमम् ॥14॥
""",
  },
  {
    "chapter": 18,
    "shlok": 15,
    "text": """शरीरवाङ्मनोभिर्यत्कर्म प्रारभते नर: ।
न्याय्यं वा विपरीतं वा पञ्चैते तस्य हेतव: ॥15॥
""",
  },
   {
    "chapter": 18,
    "shlok": 16,
    "text": """तत्रैवं सति कर्तारमात्मानं केवलं तु य: ।
पश्यत्यकृतबुद्धित्वान्न स पश्यति दुर्मति: ॥16॥
""",
  },
  {
    "chapter": 18,
    "shlok": 17,
    "text": """यस्य नाहड्.कृतो भावो बुद्धिर्यस्य न लिप्यते।
हत्वाऽपि स इमॉल्लोकान हन्ति न निबध्यते ॥17॥
""",
  },
  {
    "chapter": 18,
    "shlok": 18,
    "text": """ज्ञानं ज्ञेयं परिज्ञाता त्रिविधा कर्मचोदना ।
करणं कर्म कर्तेति त्रिविध: कर्मसंग्रह: ॥18॥
""",
  },
  {
    "chapter": 18,
    "shlok": 19,
    "text": """ज्ञानं कर्म च कर्ता च त्रिधैव गुणभेदतः।
प्रोच्यते गुणसड्.ख्याने यथावच्छृणु तान्यपि ॥19॥
""",
  },
  {
    "chapter": 18,
    "shlok": 20,
    "text": """सर्वभूतेषु येनैकं भावमव्ययमीक्षते ।
अविभक्तं विभक्तेषु तज्ज्ञानं विद्धि सात्त्विकम् ॥20॥
""",
  },
  {
    "chapter": 18,
    "shlok": 21,
    "text": """पृथक्त्वेन तु यज्ज्ञानं नानाभावान्पृथग्विधान्।
वेत्ति सर्वेषु भूतेषु तज्ज्ञानं विद्धि राजसम् ॥21॥
""",
  },
  {
    "chapter": 18,
    "shlok": 22,
    "text": """यत्तु कृत्स्नवदेकस्मिन्कार्ये सक्तमहैतुकम् ।
अतत्त्वार्थवदल्पं च तत्तामसमुदाहृतम् ॥22॥
""",
  },
  {
    "chapter": 18,
    "shlok": 23,
    "text": """नियतं सङ्गरहितमरागद्वेषतः कृतम्।
अफलप्रेप्सुना कर्म यत्तत्सात्त्विकमुच्यते ॥23॥
""",
  },
  {
    "chapter": 18,
    "shlok": 24,
    "text": """यत्तुकामेप्सुना कर्म साहङ्कारेण वा पुन: ।
क्रियते बहुलायासं तद्राजसमुदाहृतम् ॥24॥
""",
  },
  {
    "chapter": 18,
    "shlok": 25,
    "text": """अनुबन्धं क्षयं हिंसामनपेक्ष्य च पौरुषम्।
मोहादारभ्यते कर्म यत्तत्तामसमुच्यते ॥25॥
""",
  },
  {
    "chapter": 18,
    "shlok": 26,
    "text": """मुक्तसङ्गोऽनहंवादी धृत्युत्साहसमन्वित: ।
सिद्ध्यसिद्ध्योर्निर्विकार: कर्ता सात्त्विक उच्यते ॥26॥
""",
  },
  {
    "chapter": 18,
    "shlok": 27,
    "text": """रागी कर्मफलप्रेप्सुर्लुब्धो हिंसात्मकोऽशुचि: ।
हर्षशोकान्वित: कर्ता राजस: परिकीर्तित: ॥27॥
""",
  },
  {
    "chapter": 18,
    "shlok": 28,
    "text": """अयुक्तः प्राकृतः स्तब्धः शठो नैष्कृतिकोऽलसः।
विषादी दीर्घसूत्री च कर्ता तामस उच्यते ॥28॥
""",
  },
  {
    "chapter": 18,
    "shlok": 29,
    "text": """बुद्धेर्भेदं धृतेश्चैव गुणतस्त्रिविधं शृणु।
प्रोच्यमानमशेषेण पृथक्त्वेन धनञ्जय ॥29॥
""",
  },
  {
    "chapter": 18,
    "shlok": 30,
    "text": """प्रवृत्तिं च निवृत्तिं च कार्याकार्ये भयाभये।
बन्धं मोक्षं च या वेत्ति बुद्धिः सा पार्थ सात्त्विकी ॥30॥
""",
  },
  {
    "chapter": 18,
    "shlok": 31,
    "text": """यया धर्ममधर्मं च कार्यं चाकार्यमेव च ।
अयथावत्प्रजानाति बुद्धिः सा पार्थ राजसी ॥31॥
""",
  },
  {
    "chapter": 18,
    "shlok": 32,
    "text": """अधर्मं धर्ममिति या मन्यते तमसावृता।
सर्वार्थाविपरीतांश्च बुद्धिः सा पार्थ तामसी ॥32॥
""",
  },
  {
    "chapter": 18,
    "shlok": 33,
    "text": """धृत्या यया धारयते मनः प्राणेन्द्रियक्रियाः ।
योगेनाव्यभिचारिण्या धृतिः सा पार्थ सात्त्विकी ॥33॥
""",
  },
  {
    "chapter": 18,
    "shlok": 34,
    "text": """यया तु धर्मकामार्थान्धूत्या धारयतेऽर्जुन।
प्रसङ्गेन फलाकाङ्क्षी धृतिः सा पार्थ राजसी ॥34॥
""",
  },
  {
    "chapter": 18,
    "shlok": 35,
    "text": """यया स्वजं भयं शोकं विषादं मदमेव च ।
न विमुञ्चति दुर्मेधा धृतिः सा पार्थ तामसी ॥35॥
""",
  },
  {
    "chapter": 18,
    "shlok": 36,
    "text": """सुखं त्विदानी त्रिविधं शृणु मे भरतर्षभ।
अभ्यासाद्रमते यत्र दुःखान्तं च निगच्छति ॥36॥
""",
  },
  {
    "chapter": 18,
    "shlok": 37,
    "text": """यत्तदने विषमिव परिणामेऽमृतोपसम्।
तत्सुखं सात्त्विकं प्रोक्तमात्मबुद्धिप्रसादजम् ॥37॥
""",
  },
  {
    "chapter": 18,
    "shlok": 38,
    "text": """विषयेन्द्रियसंयोगाद्यत्तदग्रेऽमृतोपमम् ।
परिणामे विषमिव तत्सुखपं राजसं स्मृतम् ॥38॥
""",
  },
  {
    "chapter": 18,
    "shlok": 39,
    "text": """यदने चानुबन्धे च सुखं मोहनमात्मनः।
निद्रालस्यप्रमादोत्थं तत्तामसमुदाहृतम् ॥39॥
""",
  },
  {
    "chapter": 18,
    "shlok": 40,
    "text": """न तदस्ति पृथिव्याँ वा दिवि देवेषु वा पुनः ।
सत्त्वं प्रकृतिजैर्मुक्तं यदेभिः स्यात्रिभर्गुणैः ॥40॥
""",
  },
  {
    "chapter": 18,
    "shlok": 41,
    "text": """ब्राह्मणक्षत्रियविशां शूद्राणां च परन्तप ।
कर्माणि प्रविभक्तानि स्वभावप्रभवैर्गुणैः ॥41॥
""",
  },
  {
    "chapter": 18,
    "shlok": 42,
    "text": """शमो दमस्तपः शौचं क्षान्तिरार्जवमेव च ।
ज्ञानं विज्ञानमास्तिक्यं ब्रह्मकर्म स्वभावजम् ॥42॥
""",
  },
  {
    "chapter": 18,
    "shlok": 43,
    "text": """शौर्यं तेजो धृतिर्दाक्ष्यं युद्धे चाप्यपलायनम् ।
दानमीश्वरभावश्च क्षात्रं कर्म स्वभावजम् ॥43॥
""",
  },
  {
    "chapter": 18,
    "shlok": 44,
    "text": """कृषिगोरक्ष्यवाणिज्यं वैश्यकर्म स्वभावजम् ।
परिचर्यात्मकं कर्म शूद्रस्यापि स्वभावजम् ॥44॥
""",
  },
  {
    "chapter": 18,
    "shlok": 45,
    "text": """स्वे स्वे कर्मण्यभिरतः संसिद्धिं लभते नरः।
स्वकर्मनिरतः सिद्धिं यथा विन्दति तच्छृणु ॥45॥
""",
  },
  {
    "chapter": 18,
    "shlok": 46,
    "text": """यतः प्रवृत्तिर्भूतानां येन सर्वमिदं ततम्।
स्वकर्मणा तमभ्यर्च्य सिद्धिं विन्दति मानवः ॥46॥
""",
  },
  {
    "chapter": 18,
    "shlok": 47,
    "text": """श्रेयान्स्वधर्मो विगुणः परधार्मात्स्वनुष्ठितात् ।
स्वभावनियतं कर्म कुर्वन्नाजोति किल्बिषम् ॥47॥
""",
  },
  {
    "chapter": 18,
    "shlok": 48,
    "text": """सहजं कर्म कौन्तेय सदोषमपि न त्यजेत्।
सर्वारम्भा हि दोषेण धूमेनाग्निरिवावृताः ॥48॥
""",
  },
  {
    "chapter": 18,
    "shlok": 49,
    "text": """असक्तबुद्धिः सर्वत्र जितात्मा विगतस्पृहः।
नैष्कर्म्यसिद्धिं परमां संन्यासेनाधिगच्छति ॥49॥
""",
  },
  {
    "chapter": 18,
    "shlok": 50,
    "text": """सिद्धि प्राप्तो यथा ब्रह्म तथाप्नोति निबोध मे ।
समासेनैव कौन्तेय निष्ठा ज्ञानस्य या परा ॥50॥
""",
  },
  {
    "chapter": 18,
    "shlok": 51,
    "text": """बुद्धया विशुद्धया युक्तो धृत्यात्मानं नियम्य च।
शब्दादीन्विषयांस्त्यक्त्वा रागद्वेषौ व्युदस्य च ॥51॥
""",
  },
  {
    "chapter": 18,
    "shlok": 52,
    "text": """विविक्तसेवी लघ्वाशी यतवाक्कायमानसः।
ध्यानयोगपरो नित्यं वैराग्यं समुपाश्रितः ॥52॥
""",
  },
  {
    "chapter": 18,
    "shlok": 53,
    "text": """अहङ्कारं बलं दर्प कामं क्रोधं परिग्रहम्।
विमुच्य निर्ममः शान्तो ब्रह्मभूयाय कल्पते ॥53॥
""",
  },
  {
    "chapter": 18,
    "shlok": 54,
    "text": """ब्रह्मभूत: प्रसन्नात्मा न शोचति न काङ् क्षति ।
सम: सर्वेषु भूतेषु मद्भक्तिं लभते पराम् ॥54॥
""",
  },
  {
    "chapter": 18,
    "shlok": 55,
    "text": """भक्त्या मामभिजानाति यावान्यश्चास्मि तत्त्वतः।
ततो मां तत्त्वतो ज्ञात्वा विशते तदनन्तरम् ॥55॥
""",
  },
  {
    "chapter": 18,
    "shlok": 56,
    "text": """सर्वकर्माण्यपि सदा कुर्वाणो मद्व्यपाश्रय: ।
मत्प्रसादादवाप्नोति शाश्वतं पदमव्ययम् ॥56॥
""",
  },
  {
    "chapter": 18,
    "shlok": 57,
    "text": """चेतसा सर्वकर्माणि मयि संन्यस्य मत्परः।
बुद्धियोगमुपाश्रित्य मच्चित्तः सततं भव ॥57॥
""",
  },
  {
    "chapter": 18,
    "shlok": 58,
    "text": """मच्चित्त: सर्वदुर्गाणि मत्प्रसादात्तरिष्यसि ।
अथ चेत्वमहङ्कारान्न श्रोष्यसि विनङ्क्ष्यसि ॥58॥
""",
  },
  {
    "chapter": 18,
    "shlok": 59,
    "text": """यदहङ्कारमाश्रित्य न योत्स्य इति मन्यसे।
मिथ्यैष व्यवसायस्ते प्रकृतिस्त्वां नियोक्ष्यति ॥59॥
""",
  },
  {
    "chapter": 18,
    "shlok": 60,
    "text": """स्वभावजेन कौन्तेय निबद्ध: स्वेन कर्मणा ।
कर्तुं नेच्छसि यन्मोहात्करिष्यस्यवशोऽपि तत् ॥60॥
""",
  },
  {
    "chapter": 18,
    "shlok": 61,
    "text": """ईश्वरः सर्वभूतानां हृद्देशेऽर्जुन तिष्ठति।
भ्रामयन्सर्वभूतानि यन्त्रारूढानि मायया ॥61॥
""",
  },
  {
    "chapter": 18,
    "shlok": 62,
    "text": """तमेव शरणं गच्छ सर्वभावेन भारत ।
तत्प्रसादात्परां शान्तिं स्थानं प्राप्स्यसि शाश्वतम् ॥62॥
""",
  },
  {
    "chapter": 18,
    "shlok": 63,
    "text": """इति ते ज्ञानमाख्यातं गुह्याद्गुह्यतरं मया ।
विमृश्यैतदशेषेण यथेच्छसि तथा कुरु ॥63॥
""",
  },
  {
    "chapter": 18,
    "shlok": 64,
    "text": """सर्वगुह्यतमं भूय: शृणु मे परमं वच: ।
इष्टोऽसि मे दृढमिति ततो वक्ष्यामि ते हितम् ॥64॥
""",
  },
  {
    "chapter": 18,
    "shlok": 65,
    "text": """मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु।
मामेवैष्यसि सत्यं ते प्रतिजाने प्रियोऽसि मे ॥65।
""",
  },
  {
    "chapter": 18,
    "shlok": 66,
    "text": """सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज ।
अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुच: ॥66॥
""",
  },
  {
    "chapter": 18,
    "shlok": 67,
    "text": """इदं ते नातपस्काय नाभक्ताय कदाचन।
न चाशुश्रूषवे वाच्यं न च मां योऽभ्यसूयति ॥67॥
""",
  },
  {
    "chapter": 18,
    "shlok": 68,
    "text": """य इदं परमं गुह्यं मद्भक्तेष्वभिधास्यति ।
भक्तिं मयि परां कृत्वा मामेवैष्यत्यसंशय: ॥68॥
""",
  },
  {
    "chapter": 18,
    "shlok": 69,
    "text": """न च तस्मान्मनुष्येषु कश्चिन्मे प्रियकृत्तमः।
भविता न च मे तस्मादन्यः प्रियतरो भुवि ॥69॥
""",
  },
  {
    "chapter": 18,
    "shlok": 70,
    "text": """अध्येष्यते च य इमं धर्म्यं संवादमावयो: ।
ज्ञानयज्ञेन तेनाहमिष्ट: स्यामिति मे मति: ॥70॥
""",
  },
  {
    "chapter": 18,
    "shlok": 71,
    "text": """श्रद्धावाननसूयश्च शृणुयादपि यो नरः।
सोऽपि मुक्तः शुभाँल्लोकान्प्राप्नुयात्पुण्यकर्मणाम् ॥71॥
""",
  },
  {
    "chapter": 18,
    "shlok": 72,
    "text": """कच्चिदेतच्छ्रुतं पार्थ त्वयैकाग्रेण चेतसा ।
कच्चिदज्ञानसम्मोह: प्रनष्टस्ते धनञ्जय ॥72॥
""",
  },
  {
    "chapter": 18,
    "shlok": 73,
    "text": """अर्जुन उवाच।
नष्टो मोहः स्मृतिर्लब्धा त्वत्प्रसादान्मयाच्युत।
स्थितोऽस्मि गतसन्देहः करिष्ये वचनं तव ॥73॥
""",
  },
  {
    "chapter": 18,
    "shlok": 74,
    "text": """सञ्जय उवाच ।
इत्यहं वासुदेवस्य पार्थस्य च महात्मन: ।
संवादमिममश्रौषमद्भुतं रोमहर्षणम् ॥74॥
""",
  },
  {
    "chapter": 18,
    "shlok": 75,
    "text": """व्यासप्रसादाच्छ्रतवानेतद्गुह्यमहं परम्।
योगं योगेश्वरात्कृष्णात्साक्षात्कथयतः स्वयम् ॥75॥
""",
  },
  {
    "chapter": 18,
    "shlok": 76,
    "text": """राजन्संस्मृत्य संस्मृत्य संवादमिममद्भुतम् ।
केशवार्जुनयो: पुण्यं हृष्यामि च मुहुर्मुहु: ॥76॥
""",
  },
  {
    "chapter": 18,
    "shlok": 77,
    "text": """तच्च संस्मृत्य संस्मृत्य रूपमत्यद्भुतं हरेः।
विस्मयो मे महाराजन्हष्यामि च पुनः पुनः ॥77॥
""",
  },
  {
    "chapter": 18,
    "shlok": 78,
    "text": """यत्र योगेश्वर: कृष्णो यत्र पार्थो धनुर्धर: ।
तत्र श्रीर्विजयो भूतिध्रुवा नीतिर्मतिर्मम ॥78॥
""",
  },
];
