final List<Map<String, dynamic>> geeta_01 = [
  {
    "chapter": 01,
    "shlok": 01,
    "text": """धृतराष्ट्र उवाच ।
धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः ।
मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय ॥1॥
""",
  },
  {
    "chapter": 01,
    "shlok": 02,
    "text": """सञ्जय उवाच ।
दृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा ।
आचार्यमुपसङ्गम्य राजा वचनमब्रवीत् ॥2॥
""",
  },
  {
    "chapter": 01,
    "shlok": 03,
    "text": """पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम् ।
व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता ॥3॥
""",
  },
  {
    "chapter": 01,
    "shlok": 04,
    "text": """अत्र शूरा महेष्वासा भीमार्जुनसमा युधि
युयुधानो विराटश्च द्रुपदश्च महारथ: ॥4॥
""",
  },
  {
    "chapter": 01,
    "shlok": 05,
    "text": """धृष्टकेतुश्चेकितान: काशिराजश्च वीर्यवान् ।
पुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङ्गव: ॥5॥
""",
  },
  {
    "chapter": 01,
    "shlok": 06,
    "text": """युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान् ।
सौभद्रो द्रौपदेयाश्च सर्व एव महारथा: ॥6॥
""",
  },
  {
    "chapter": 01,
    "shlok": 07,
    "text": """अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम ।
नायका मम सैन्यस्य संज्ञार्थं तान्ब्रवीमि ते ॥7॥
""",
  },
  {
    "chapter": 01,
    "shlok": 08,
    "text": """भवान्भीष्मश्च कर्णश्च कृपश्च समितिञ्जय: ।
अश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च ॥8॥
""",
  },
  {
    "chapter": 01,
    "shlok": 09,
    "text": """अन्ये च बहव: शूरा मदर्थे त्यक्तजीविता: ।
नानाशस्त्रप्रहरणा: सर्वे युद्धविशारदा: ॥9॥
""",
  },
  {
    "chapter": 01,
    "shlok": 10,
    "text": """अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम् ।
पर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम् ॥10॥
""",
  },
  {
    "chapter": 01,
    "shlok": 11,
    "text": """अयनेषु च सर्वेषु यथाभागमवस्थिता: ।
भीष्ममेवाभिरक्षन्तु भवन्त: सर्व एव हि ॥11॥
""",
  },
  {
    "chapter": 01,
    "shlok": 12,
    "text": """तस्य सञ्जनयन्हर्षं कुरुवृद्धः पितामहः।
सिंहनादं विनद्योच्चैः शङ्ख दध्मौ प्रतापवान् ॥12॥
""",
  },
  {
    "chapter": 01,
    "shlok": 13,
    "text": """तत: शङ्खाश्च भेर्यश्च पणवानकगोमुखा: ।
सहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत् ॥13॥
""",
  },
  {
    "chapter": 01,
    "shlok": 14,
    "text": """ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ।
माधवः पाण्डवश्चैव दिव्यौ शङ्खौ प्रदध्मतुः ॥14॥
""",
  },
  {
    "chapter": 01,
    "shlok": 15,
    "text": """पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जय: ।
पौण्ड्रं दध्मौ महाशङ्खं भीमकर्मा वृकोदर: ॥15॥
""",
  },
  {
    "chapter": 01,
    "shlok": 16,
    "text": """अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिर: ।
नकुल: सहदेवश्च सुघोषमणिपुष्पकौ ॥16॥
""",
  },

  {
    "chapter": 01,
    "shlok": 17,
    "text": """काश्यश्च परमेष्वास: शिखण्डी च महारथ: ।
धृष्टद्युम्नो विराटश्च सात्यकिश्चापराजित: ॥17॥
""",
  },
  {
    "chapter": 01,
    "shlok": 18,
    "text": """द्रुपदो द्रौपदेयाश्च सर्वश: पृथिवीपते ।
सौभद्रश्च महाबाहु: शङ्खान्दध्मु: पृथक् पृथक् ॥18॥
""",
  },
  {
    "chapter": 01,
    "shlok": 19,
    "text": """स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत्।
नभश्च पृथिवीं चैव तुमुलोऽभ्यनुनादयन् ॥19॥
""",
  },
  {
    "chapter": 01,
    "shlok": 20,
    "text": """अर्जुन उवाच।
अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान् कपिध्वज: ।
प्रवृत्ते शस्त्रसम्पाते धनुरुद्यम्य पाण्डव: ॥20॥
""",
  },
  {
    "chapter": 01,
    "shlok": 21,
    "text": """हृषीकेशं तदा वाक्यमिदमाह महीपते ।
सेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत ॥21॥

""",
  },
  {
    "chapter": 01,
    "shlok": 22,
    "text": """यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान् ।
कैर्मया सह योद्धव्यमस्मिन् रणसमुद्यमे ॥22॥
""",
  },

  {
    "chapter": 01,
    "shlok": 23,
    "text": """योत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः।
धार्तराष्ट्रस्य दुर्बुद्धेयुद्धे प्रियचिकीर्षवः ॥23॥
""",
  },
  {
    "chapter": 01,
    "shlok": 24,
    "text": """सञ्जय उवाच ।
एवमुक्तो हृषीकेशो गुडाकेशेन भारत ।
सेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम् ॥ 24॥
""",
  },
  {
    "chapter": 01,
    "shlok": 25,
    "text": """भीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम्।
उवाच पार्थ पश्यैतान्समवेतान्कुरूनिति ॥25॥
""",
  },
  {
    "chapter": 01,
    "shlok": 26,
    "text": """तत्रापश्यत्स्थितान् पार्थ: पितृ नथ पितामहान् ।
आचार्यान्मातुलान्भ्रातृ न्पुत्रान्पौत्रान्सखींस्तथा ॥26॥

""",
  },
  {
    "chapter": 01,
    "shlok": 27,
    "text": """श्वशुरान्सुहृदश्चैव सेनयोरुभयोरपि । 
    तान्समीक्ष्य स कौन्तेय: सर्वान्बन्धूनवस्थितान् ॥27॥

""",
  },
  {
    "chapter": 01,
    "shlok": 28,
    "text": """अर्जुन उवाच।
    कृपया परयाविष्टो विषीदन्निदमब्रवीत् ।
दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम् ॥28॥
""",
  },
  {
    "chapter": 01,
    "shlok": 29,
    "text": """सीदन्ति मम गात्राणि मुखं च परिशुष्यति ।
वेपथुश्च शरीरे मे रोमहर्षश्च जायते ॥ 29॥
""",
  },
  {
    "chapter": 01,
    "shlok": 30,
    "text": """गाण्डीवं स्रंसते हस्तात्त्वक्चै व परिदह्यते ।
न च शक्नोम्यवस्थातुं भ्रमतीव च मे मन: ॥30॥
""",
  },
  {
    "chapter": 01,
    "shlok": 31,
    "text": """निमित्तानि च पश्यामि विपरीतानि केशव ।
न च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे ॥31॥
""",
  },
  {
    "chapter": 01,
    "shlok": 32,
    "text": """न काङ्‍क्षे विजयं कृष्ण न च राज्यं सुखानि च ।
किं नो राज्येन गोविंद किं भोगैर्जीवितेन वा ॥32॥
""",
  },
  {
    "chapter": 01,
    "shlok": 33,
    "text": """येषामर्थे काक्षितं नो राज्यं भोगाः सुखानि च ।
त इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च ॥33॥
""",
  },
  {
    "chapter": 01,
    "shlok": 34,
    "text": """आचार्या: पितर: पुत्रास्तथैव च पितामहा: ।
मातुला: श्वशुरा: पौत्रा: श्याला: सम्बन्धिनस्तथा ॥34॥

""",
  },
  {
    "chapter": 01,
    "shlok": 35,
    "text": """एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन ।
अपि त्रैलोक्यराज्यस्य हेतो: किं नु महीकृते ॥35॥
""",
  },
  {
    "chapter": 01,
    "shlok": 36,
    "text": """निहत्य धार्तराष्ट्रान्नः का प्रीतिः स्याज्जनार्दन।
पापमेवाश्रयेदस्मान्हत्वैतानाततायिनः॥36॥

""",
  },
  {
    "chapter": 01,
    "shlok": 37,
    "text": """तस्मान्नार्हा वयं हन्तुं धार्तराष्ट्रान्स्वबान्धवान्।
स्वजनं हि कथं हत्वा सुखिनः स्याम माधव ॥37॥
""",
  },
  {
    "chapter": 01,
    "shlok": 38,
    "text": """यद्यप्येते न पश्यन्ति लोभोपहतचेतस: ।
कुलक्षयकृतं दोषं मित्रद्रोहे च पातकम् ॥38॥
""",
  },
  {
    "chapter": 01,
    "shlok": 39,
    "text": """कथं न ज्ञेयमस्माभि: पापादस्मान्निवर्तितुम् ।
कुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन ॥39॥
""",
  },
  {
    "chapter": 01,
    "shlok": 40,
    "text": """कुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः।
धर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत ॥40॥
""",
  },
  {
    "chapter": 01,
    "shlok": 41,
    "text": """अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रिय: ।
स्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसङ्कर: ॥41॥
""",
  },
  {
    "chapter": 01,
    "shlok": 42,
    "text": """सङ्करो नरकायैव कुलघ्नानां कुलस्य च ।
पतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रिया: ॥42॥
""",
  },
  {
    "chapter": 01,
    "shlok": 43,
    "text": """दोषैरेतैः कुलजानां वर्णसङ्करकारकैः।
उत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः ॥43॥
""",
  },
  {
    "chapter": 01,
    "shlok": 44,
    "text": """उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन ।
नरकेऽनियतं वासो भवतीत्यनुशुश्रुम ॥44॥
""",
  },
  {
    "chapter": 01,
    "shlok": 45,
    "text": """अहो बत महत्पापं कर्तुं व्यवसिता वयम्।
यद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः ॥45॥
""",
  },
   {
    "chapter": 01,
    "shlok": 46,
    "text": """यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः।
धार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत् ॥46॥
""",
  },
  {
    "chapter": 01,
    "shlok": 47,
    "text": """सञ्जय उवाच ।
एवमुक्त्वार्जुन: सङ्ख्ये रथोपस्थ उपाविशत् ।
विसृज्य सशरं चापं शोकसंविग्नमानस: ॥47॥
""",
  },
];
