final List<Map<String, dynamic>> geeta_08 = [
  {
    "chapter": 08,
    "shlok": 01,
    "text": """अर्जुन उवाच ।
किं तद्ब्रह्म किमध्यात्मं किं कर्म पुरुषोत्तम ।
अधिभूतं च किं प्रोक्तमधिदैवं किमुच्यते ॥1॥
""",
  },
  {
    "chapter": 08,
    "shlok": 02,
    "text": """अधियज्ञ: कथं कोऽत्र देहेऽस्मिन्मधुसूदन ।
प्रयाणकाले च कथं ज्ञेयोऽसि नियतात्मभि: ॥2॥
""",
  },
  {
    "chapter": 08,
    "shlok": 03,
    "text": """श्रीभगवान उवाच।
अक्षरं ब्रह्म परमं स्वभावोऽध्यात्ममुच्यते।
भूतभावोद्भवकरो विसर्गः कर्मसज्ञितः ॥3॥
""",
  },
  {
    "chapter": 08,
    "shlok": 04,
    "text": """अधिभूतं क्षरो भाव: पुरुषश्चाधिदैवतम् ।
अधियज्ञोऽहमेवात्र देहे देहभृतां वर ॥4॥
""",
  },
  {
    "chapter": 08,
    "shlok": 05,
    "text": """अन्तकाले च मामेव स्मरन्मुक्त्वा कलेवरम् ।
यः प्रयाति स मुद्भावं याति नास्त्यत्र संशयः ॥5॥
""",
  },
  {
    "chapter": 08,
    "shlok": 06,
    "text": """यं यं वापि स्मरन्भावं त्यजत्यन्ते कलेवरम् ।
तं तमेवैति कौन्तेय सदा तद्भावभावित: ॥6॥
""",
  },
  {
    "chapter": 08,
    "shlok": 07,
    "text": """तस्मात्सर्वेषु कालेषु मामनुस्मर युध्य च ।
मय्यर्पितमनोबुद्धिर्मामेवैष्यस्यसंशयम् ॥7॥
""",
  },
  {
    "chapter": 08,
    "shlok": 08,
    "text": """अभ्यासयोगयुक्तेन चेतसा नान्यगामिना ।
परमं पुरुषं दिव्यं याति पार्थानुचिन्तयन् ॥8॥
""",
  },
  {
    "chapter": 08,
    "shlok": 09,
    "text": """कविं पुराणमनुशासितारमणोरणीयांसमनुस्मरेद्यः ।
सर्वस्य धातारमचिन्त्यरूपमादित्यवर्णं तमसः परस्तात् ॥9॥
""",
  },
  {
    "chapter": 08,
    "shlok": 10,
    "text": """प्रयाणकाले मनसाचलेन भक्त्या युक्तो योगबलेन चैव ।
भ्रुवोर्मध्ये प्राणमावेश्य सम्यक् स तं परं पुरुषमुपैति दिव्यम् ॥10॥
""",
  },
  {
    "chapter": 08,
    "shlok": 11,
    "text": """यदक्षरं वेदविदो वदन्ति
विशन्ति यद्यतयो वीतरागा: ।
यदिच्छन्तो ब्रह्मचर्यं चरन्ति
तत्ते पदं संग्रहेण प्रवक्ष्ये ॥11॥
""",
  },
  {
    "chapter": 08,
    "shlok": 12,
    "text": """सर्वद्वाराणि संयम्य मनो हृदि निरुध्य च ।
मूर्ध्याधायात्मनः प्राणमास्थितो योगधारणाम् ॥12॥
""",
  },
  {
    "chapter": 08,
    "shlok": 13,
    "text": """ओमित्येकाक्षरं ब्रह्म व्याहरन्मामनुस्मरन् ।
य: प्रयाति त्यजन्देहं स याति परमां गतिम् ॥13॥
""",
  },
  {
    "chapter": 08,
    "shlok": 14,
    "text": """अनन्यचेताः सततं यो मां स्मरति नित्यशः ।
तस्याहं सुलभः पार्थ नित्यमुक्तस्य योगिनः ॥14॥
""",
  },
  {
    "chapter": 08,
    "shlok": 15,
    "text": """मामुपेत्य पुनर्जन्म दु:खालयमशाश्वतम् ।
नाप्नुवन्ति महात्मान: संसिद्धिं परमां गता: ॥15॥
""",
  },
  {
    "chapter": 08,
    "shlok": 16,
    "text": """आब्रह्मभुवनाल्लोकाः पुनरावर्तिनोऽर्जुन ।
मामुपेत्य तु कौन्तेय पुनर्जन्म न विद्यते ॥16॥
""",
  },
  {
    "chapter": 08,
    "shlok": 17,
    "text": """सहस्रयुगपर्यन्तमहर्यद्ब्रह्मणो विदु: ।
रात्रिं युगसहस्रान्तां तेऽहोरात्रविदो जना: ॥17॥
""",
  },
  {
    "chapter": 08,
    "shlok": 18,
    "text": """अव्यक्ताद्व्यक्तयः सर्वाः प्रभवन्त्यहरागमे।
रात्र्यागमे प्रलीयन्ते तत्रैवाव्यक्तसञके ॥18॥
""",
  },
  {
    "chapter": 08,
    "shlok": 19,
    "text": """भूतग्राम: स एवायं भूत्वा भूत्वा प्रलीयते ।
रात्र्यागमेऽवश: पार्थ प्रभवत्यहरागमे ॥19॥
""",
  },
  {
    "chapter": 08,
    "shlok": 20,
    "text": """परस्तस्मात्तु भावोऽन्योऽव्यक्तोऽव्यक्तात्सनातनः ।
यः स सर्वेषु भूतेषु नश्यत्सु न विनश्यति ॥20॥
""",
  },
  {
    "chapter": 08,
    "shlok": 21,
    "text": """अव्यक्तोऽक्षर इत्युक्तस्तमाहु: परमां गतिम् ।
यं प्राप्य न निवर्तन्ते तद्धाम परमं मम ॥21॥
""",
  },
  {
    "chapter": 08,
    "shlok": 22,
    "text": """पुरुषः स परः पार्थ भक्त्या लभ्यस्त्वनन्यया ।
यस्यान्तःस्थानि भूतानि येन सर्वमिदं ततम् ॥22॥
""",
  },
  {
    "chapter": 08,
    "shlok": 23,
    "text": """यत्र काले त्वनावृत्तिमावृत्तिं चैव योगिन: ।
प्रयाता यान्ति तं कालं वक्ष्यामि भरतर्षभ ॥23॥
""",
  },
  {
    "chapter": 08,
    "shlok": 24,
    "text": """अग्निर्ज्योतिरह: शुक्ल: षण्मासा उत्तरायणम् ।
तत्र प्रयाता गच्छन्ति ब्रह्म ब्रह्मविदो जना: ॥24॥
""",
  },
  {
    "chapter": 08,
    "shlok": 25,
    "text": """धूमो रात्रिस्तथा कृष्ण: षण्मासा दक्षिणायनम् ।
तत्र चान्द्रमसं ज्योतिर्योगी प्राप्य निवर्तते ॥25॥
""",
  },
  {
    "chapter": 08,
    "shlok": 26,
    "text": """शुक्लकृष्णे गती ह्येते जगत: शाश्वते मते ।
एकया यात्यनावृत्तिमन्ययावर्तते पुन: ॥26॥
""",
  },
  {
    "chapter": 08,
    "shlok": 27,
    "text": """नैते सृती पार्थ जानन्योगी मुह्यति कश्चन ।
तस्मात्सर्वेषु कालेषु योगयुक्तो भवार्जुन ॥27॥
""",
  },
  {
    "chapter": 08,
    "shlok": 28,
    "text": """वेदेषु यज्ञेषु तप:सु चैव
दानेषु यत्पुण्यफलं प्रदिष्टम् ।
अत्येति तत्सर्वमिदं विदित्वा
योगी परं स्थानमुपैति चाद्यम् ॥28॥
""",
  },
];
