final List<Map<String, dynamic>> geeta_11 = [
  {
    "chapter": 11,
    "shlok": 01,
    "text": """अर्जुन उवाच ।
मदनुग्रहाय परमं गुह्यमध्यात्मसञ्ज्ञितम् ।
यत्त्वयोक्तं वचस्तेन मोहोऽयं विगतो मम ॥1॥
""",
  },
  {
    "chapter": 11,
    "shlok": 02,
    "text": """भवाप्ययौ हि भूतानां श्रुतौ विस्तरशो मया ।
त्वत्तः कमलपत्राक्ष माहात्म्यमपि चाव्ययम् ॥2॥
""",
  },
  {
    "chapter": 11,
    "shlok": 03,
    "text": """एवमेतद्यथात्थ त्वमात्मानं परमेश्वर ।
द्रष्टुमिच्छामि ते रूपमैश्वरं पुरुषोत्तम ॥3॥
""",
  },
  {
    "chapter": 11,
    "shlok": 04,
    "text": """मन्यसे यदि तच्छक्यं मया द्रष्टुमिति प्रभो ।
योगेश्वर ततो मे त्वं दर्शयात्मानमव्ययम् ॥4॥
""",
  },
  {
    "chapter": 11,
    "shlok": 05,
    "text": """श्रीभगवानुवाच।
पश्य मे पार्थ रूपाणि शतशोऽथ सहस्रशः।
नानाविधानि दिव्यानि नानावर्णाकृतीनि च ॥5॥
""",
  },
  {
    "chapter": 11,
    "shlok": 06,
    "text": """पश्यादित्यान्वसूरुद्रानश्विनौ मरुतस्तथा ।
बहून्यदृष्टपूर्वाणि पश्याश्चर्याणि भारत ॥6॥
""",
  },
  {
    "chapter": 11,
    "shlok": 07,
    "text": """इहैकस्थं जगत्कृत्स्नं पश्याद्य सचराचरम् ।
मम देहे गुडाकेश यच्चान्यद्रष्टुमिच्छसि ॥7॥
""",
  },
  {
    "chapter": 11,
    "shlok": 08,
    "text": """न तु मां शक्यसे द्रष्टमनेनैव स्वचक्षुषा।
दिव्यं ददामि ते चक्षुः पश्य मे योगमैश्वरम् ॥8॥
""",
  },
  {
    "chapter": 11,
    "shlok": 09,
    "text": """सञ्जय उवाच।
एवमुक्त्वा ततो राजन्महायोगेश्वरो हरिः ।
दर्शयामास पार्थाय परमं रूपमैश्वरम् ॥9॥
""",
  },
  {
    "chapter": 11,
    "shlok": 10,
    "text": """अनेकवक्त्रनयनमनेकाद्भुतदर्शनम् ।
अनेकदिव्याभरणं दिव्यानेकोद्यतायुधम् ॥10॥
""",
  },
  {
    "chapter": 11,
    "shlok": 11,
    "text": """योग दिव्यमाल्याम्बरधरं दिव्यमन्धानुलेपनम्।
सर्वाश्चर्यमयं देवमनन्तं विश्वतोमुखम् ॥11॥
""",
  },
  {
    "chapter": 11,
    "shlok": 12,
    "text": """दिवि सूर्यसहस्रस्य भवेद्युगपदुत्थिता ।
यदि भाः सदृशी सा स्याद्भासस्तस्य महात्मनः ॥12॥
""",
  },
  {
    "chapter": 11,
    "shlok": 13,
    "text": """तत्रैकस्थं जगत्कृत्स्नं प्रविभक्तमनेकधा ।
अपश्यद्देवदेवस्य शरीरे पाण्डवस्तदा ॥13॥
""",
  },
  {
    "chapter": 11,
    "shlok": 14,
    "text": """ततः स विस्मयाविष्टो हृष्टरोमा धनञ्जयः ।
प्रणम्य शिरसा देवं कृताञ्जलिरभाषत ॥14॥
""",
  },
  {
    "chapter": 11,
    "shlok": 15,
    "text": """अर्जुन उवाच।
पश्यामि देवांस्तव देव देहे सर्वांस्तथा भूतविशेषसङ्घान्।
ब्रह्माणमीशं कमलासनस्थ-मृषींश्च सर्वानुरगांश्च दिव्यान् ॥15॥
""",
  },
  {
    "chapter": 11,
    "shlok": 16,
    "text": """अनेकबाहूदरवक्त्रनेत्रं
पश्यामि त्वां सर्वतोऽनन्तरूपम्।
नान्तं न मध्यं न पुनस्तवादिं
पश्यामि विश्वेश्वर विश्वरुप ॥16॥
""",
  },
  {
    "chapter": 11,
    "shlok": 17,
    "text": """किरीटिनं गदिनं चक्रिणं च
तेजोराशिं सर्वतो दीप्तिमन्तम् ।
पश्यामि त्वां दुर्निरीक्ष्यं समन्ताद्
दीप्तानलार्कद्युतिमप्रमेयम् ॥17॥
""",
  },
  {
    "chapter": 11,
    "shlok": 18,
    "text": """त्वमक्षरं परमं वेदितव्यं
त्वमस्य विश्वस्य परं निधानम्।
त्वमव्ययः शाश्वतधर्मगोप्ता
सनातनस्त्वं पुरुषो मतो मे ॥18॥
""",
  },
  {
    "chapter": 11,
    "shlok": 19,
    "text": """अनादिमधयान्तमनन्तवीर्यमनन्तबाहुं शशिसूर्यनेत्रम् ।
पश्यामि त्वां दीप्तहुताशवक्त्रं स्वतेजसा विश्वमिदं तपन्तम् ॥19॥
""",
  },
  {
    "chapter": 11,
    "shlok": 20,
    "text": """द्यावापृथिव्योरिदमन्तरं हि व्याप्तं त्वयैकेन दिशश्च सर्वाः।
दृष्ट्वाद्भुतं रूपमुग्रं तवेदं लोकत्रयं प्रव्यथितं महात्मन् ॥20॥
""",
  },
  {
    "chapter": 11,
    "shlok": 21,
    "text": """अमी हि त्वां सुरसङ्घा विशन्ति
केचिद्भीताः प्राञ्जलयो गृणन्ति ।
स्वस्तीत्युक्त्वा महर्षिसिद्धसङ्घाः
स्तुवन्ति त्वां स्तुतिभिः पुष्कलाभिः ॥21॥
""",
  },
  {
    "chapter": 11,
    "shlok": 22,
    "text": """रुद्रादित्या वसवो ये च साध्या विश्वेऽश्विनौ मरुतश्चोष्मपाश्च ।
गन्धर्वयक्षासुरसिद्धसङ्घा वीक्षन्ते त्वां विस्मिताश्चैव सर्वे ॥22॥
""",
  },
  {
    "chapter": 11,
    "shlok": 23,
    "text": """रूपं महत्ते बहुवक्त्रनेत्रं महाबाहो बहुबाहूरुपादम् ।
बहूदरं बहुदंष्ट्राकरालं दृष्ट्वा लोकाः प्रव्यथितास्तथाहम् ॥23॥
""",
  },
  {
    "chapter": 11,
    "shlok": 24,
    "text": """नभः स्पृशं दीप्तमनेकवर्णं व्यात्ताननं दीप्तविशालनेत्रम्।
दृष्ट्ववा हि त्वां प्रव्यथितान्तरात्मा धृतिं न विन्दामि शमं च विष्णो ॥24॥
""",
  },
  {
    "chapter": 11,
    "shlok": 25,
    "text": """दंष्ट्राकरालानि च ते मुखानि दृष्ट्वैव कालानलसन्निभानि ।
दिशो न जाने न लभे च शर्म प्रसीद देवेश जगन्निवास ॥25॥
""",
  },
  {
    "chapter": 11,
    "shlok": 26,
    "text": """अमी च त्वां धृतराष्ट्रस्य पुत्राः सर्वे सहैवावनिपालसङ्घः ।
भीष्मो द्रोणः सूतपुत्रस्तथासौ सहास्मदीयैरपि योधमुख्यैः ॥26॥
""",
  },
  {
    "chapter": 11,
    "shlok": 27,
    "text": """वक्त्राणि ते त्वरमाणा विशन्ति दंष्ट्राकरालानि भयानकानि ।
केचिद्विलग्ना दशनान्तरेषु सन्दृश्यन्ते चूर्णितैरुत्तमाङ्गः॥27॥
""",
  },
  {
    "chapter": 11,
    "shlok": 28,
    "text": """यथा नदीनां बहवोऽम्बुवेगा:
समुद्रमेवाभिमुखा द्रवन्ति ।
तथा तवामी नरलोकवीरा
विशन्ति वक्त्राण्यभिविज्वलन्ति ॥28॥
""",
  },
  {
    "chapter": 11,
    "shlok": 29,
    "text": """यथा प्रदीप्तं ज्वलनं पतङ्गा
विशन्ति नाशाय समृद्धवेगा: ।
तथैव नाशाय विशन्ति लोका-
स्तवापि वक्त्राणि समृद्धवेगा:॥29॥
""",
  },
  {
    "chapter": 11,
    "shlok": 30,
    "text": """लेलिसे ग्रसमानः समन्ताल्लोकान्समग्रान्वदनैर्व्वलद्भिः।
तेजोभिरापूर्य जगत्समग्रं भासस्तवोग्राः प्रतपन्ति विष्णो ॥30॥
""",
  },
  {
    "chapter": 11,
    "shlok": 31,
    "text": """आख्याहि मे को भवानुग्ररूपो नमोऽस्तु ते देववर प्रसीद।
विज्ञातुमिच्छामि भवन्माद्यं न हि प्रजानामि तव प्रवृत्तिम् ॥31॥
""",
  },
  {
    "chapter": 11,
    "shlok": 32,
    "text": """श्रीभगवानुवाच।
कालोऽस्मि लोकक्षयकृत्प्रवृद्धो लोकान्समाहर्तुमिह प्रवृत्तः ।
ऋतेऽपि त्वां न भविष्यन्ति सर्वे येऽवस्थिताः प्रत्यनीकेषु योधाः ॥32॥
""",
  },
  {
    "chapter": 11,
    "shlok": 33,
    "text": """तस्मात्त्वमुत्तिष्ठ यशो लभस्व
जित्वा शत्रून्भुक्ष्व राज्यं समृद्धम् ।
मयैवैते निहताः पूर्वमेव
निमित्तमात्रं भव सव्यसाचिन् ॥33॥
""",
  },
  {
    "chapter": 11,
    "shlok": 34,
    "text": """द्रोणं च भीष्मं च जयद्रथं च
कर्णं तथान्यानपि योधवीरान् ।
मया हतांस्त्वं जहि मा व्यथिष्ठा
युध्यस्व जेतासि रणे सपत्नान् ॥34॥
""",
  },
  {
    "chapter": 11,
    "shlok": 35,
    "text": """सञ्जय उवाच।
एतच्छ्रुत्वा वचनं केशवस्य कृताञजलिर्वेपमानः किरीटी।
नमस्कृत्वा भूय एवाह कृष्णं सगद्गदं भीतभीतः प्रणम्य ॥35॥
""",
  },
  {
    "chapter": 11,
    "shlok": 36,
    "text": """अर्जुन उवाच। स्थाने हृषीकेश तव प्रकीर्त्या जगत्प्रहृष्यत्यनुरज्यते च ।
रक्षांसि भीतानि दिशो द्रवन्ति सर्वे नमस्यन्ति च सिद्धसङ्घाः॥36॥
""",
  },
  {
    "chapter": 11,
    "shlok": 37,
    "text": """विश्व रूप दर्शन योग कस्माच्च ते न नमेरन्महात्मन् गरीयसे ब्रह्मणोऽप्यादिकत्रे
अनन्त देवेश जगन्निवास त्वमक्षरं सदसत्तत्परं यत् ॥37॥
""",
  },
  {
    "chapter": 11,
    "shlok": 38,
    "text": """त्वमादिदेवः पुरुषः पुराण स्त्वमस्य विश्वस्य परं निधानम्।
वेत्तासि वेद्यं च परं च धाम त्वया ततं विश्वमनन्तरूप ॥38॥
""",
  },
  {
    "chapter": 11,
    "shlok": 39,
    "text": """वायुर्यमोऽग्निर्वरुणः शशाङ्कः प्रजापतिस्त्वं प्रपितामहश्च।
नमो नमस्तेऽस्तु सहस्त्रकृत्वः पुनश्च भूयोऽपि नमो नमस्ते ॥39॥
""",
  },
  {
    "chapter": 11,
    "shlok": 40,
    "text": """नम: पुरस्तादथ पृष्ठतस्ते
नमोऽस्तु ते सर्वत एव सर्व ।
अनन्तवीर्यामितविक्रमस्त्वं
सर्वं समाप्नोषि ततोऽसि सर्व: ॥40॥
""",
  },
  {
    "chapter": 11,
    "shlok": 41,
    "text": """सखेति मत्वा प्रसभं यदुक्तं हे कृष्ण हे यादव हे सखेति।
अजानता महिमानं तवेदं मया प्रमादात्प्रणयेन वापि ॥41॥
""",
  },
  {
    "chapter": 11,
    "shlok": 42,
    "text": """यच्चावहासार्थमसत्कृतोऽसि विहारशय्यासनभोजनेषु
एकोऽथवाप्यच्युत तत्समक्षं तत्क्षामये त्वामहमप्रमेयम् ॥42॥
""",
  },
  {
    "chapter": 11,
    "shlok": 43,
    "text": """पितासि लोकस्य चराचरस्य त्वमस्य पूज्यश्च गुरुर्गरीयान्।
न त्वत्समोऽस्त्यभ्यधिकः कुतोऽन्यो लोकत्रयेऽप्यप्रतिमप्रभाव ॥43॥
""",
  },
  {
    "chapter": 11,
    "shlok": 44,
    "text": """तस्मात्प्रणम्य प्रणिधाय कायं प्रसादये त्वामहमीशमीड्यम् ।
पितेव पुत्रस्य सखेव सख्युः प्रियः प्रियायार्हसि देव सोढुम् ॥4॥
""",
  },
  {
    "chapter": 11,
    "shlok": 45,
    "text": """अदृष्टपूर्वं हृषितोऽस्मि दृष्ट्वा भयेन च प्रव्यथितं मनो मे ।
तदेव मे दर्शय देवरुपं प्रसीद देवेश जगन्निवास ॥45॥
""",
  },
  {
    "chapter": 11,
    "shlok": 46,
    "text": """किरीटिनं गदिनं चक्रहस्त-मिच्छामि त्वां द्रष्टुमहं तथैव।
तेनैव रूपेण चतुर्भुजेन सहस्रबाहो भव विश्वमूर्ते ॥46॥
""",
  },
  {
    "chapter": 11,
    "shlok": 47,
    "text": """श्रीभगवानुवाच।
मया प्रसन्नेन तवार्जुनेदं रूपं परं दर्शितमात्मयोगात्।
तेजोमयं विश्वमनन्तमाद्यं यन्मे त्वदन्येन न दृष्टपूर्वम् ॥47॥
""",
  },
  {
    "chapter": 11,
    "shlok": 48,
    "text": """ने वेदयज्ञाध्ययनैर्न दानै-र्न च क्रियाभिर्न तपोभिरुग्रैः ।
एवंरूपः शक्य अहं नृलोके द्रष्टुं त्वदन्येन कुरुप्रवीर ॥48॥
""",
  },
  {
    "chapter": 11,
    "shlok": 49,
    "text": """मा ते व्यथा मा च विमूढभावो दृष्ट्वा रूपं घोरमीदृङ्ममेदम् ।
व्यपेतभीः प्रीतमनाः पुनस्त्वं तदेव मे रूपमिदं प्रपश्य ॥49॥
""",
  },
  {
    "chapter": 11,
    "shlok": 50,
    "text": """सञ्जय उवाच।
इत्यर्जुनं वासुदेवस्तथोक्तवा स्वकं रूपं दर्शयामास भूयः ।
आश्वासयामास च भीतमेनं भूत्वा पुनः सौम्यवपुर्महात्मा ॥50॥
""",
  },
  {
    "chapter": 11,
    "shlok": 51,
    "text": """अर्जुन उवाच।
दृष्ट्वेदं मानुषं रूपं तव सौम्यं जनार्दन ।
इदानीमस्मि संवृत्तः सचेताः प्रकृतिं गतः ॥51॥
""",
  },
  {
    "chapter": 11,
    "shlok": 52,
    "text": """श्रीभगवानउवाच।
सुदुर्दर्शमिदं रूपं दृष्टवानसि यन्मम ।
देवा अप्यस्य रूपस्य नित्यं दर्शनकाड्.क्षिणः ॥52॥
""",
  },
  {
    "chapter": 11,
    "shlok": 53,
    "text": """नाहं वेदैर्न तपसा न दानेन न चेज्यया ।
शक्य एवंविधो द्रष्टुं दृष्टवानसि मां यथा ॥53॥
""",
  },
  {
    "chapter": 11,
    "shlok": 54,
    "text": """भक्त्या त्वनन्यया शक्य अहमेवंविधोऽर्जुन ।
ज्ञातुं द्रष्टुं च तत्त्वेन प्रवेष्टुं च परन्तप ॥54॥
""",
  },
  {
    "chapter": 11,
    "shlok": 55,
    "text": """मत्कर्मकृन्मत्परमो मद्भक्तः सङ्गवर्जितः ।
निर्वैरः सर्वभूतेषु यः स मामेति पाण्डव ॥55॥
""",
  },
];
