List<String> chapterNames = [
  'अर्जुनविषादयोग',
  'सांख्ययोग',
  'कर्मयोग',
  'ज्ञानकर्मसंन्यासयोग',
  'कर्मसंन्यासयोग',
  'आत्मसंयमयोग',
  'ज्ञानविज्ञानयोग',
  'ब्रह्मयोग',
  'राजगुह्ययोग',
  'विभूतियोग',
  'विश्वरूपदर्शनयोग',
  'भक्तियोग',
  'क्षेत्रक्षेत्रज्ञविभागयोग',
  'गुण-त्रयविभागयोग',
  'पुरुषोतमयोग',
  'दैवासुरसंपद्विभाग',
  'श्र्द्धात्रयविभागयोग',
  'मोक्षसंन्यासयोग',
];

List<int> shlokCounts = [
  47, // 1
  72, // 2
  43, // 3
  42, // 4
  29, // 5
  47, // 6
  30, // 7
  28, // 8
  34, // 9
  42, // 10
  55, // 11
  20, // 12
  35, // 13
  27, // 14
  20, // 15
  24, // 16
  28, // 17
  78, // 18
];